[{
    "id": 25,
    "title":"Spotify Killed the Playback Star: Reflections on the iPod",
    "date_published":"April 16, 2019",
    "credits":"Anton Tablante | Picture by: Jiro Reyes",
    "image":"\/images\/articles\/ipod.png",
    "content": "<p>I have a small confession to make – one to do with how I grew up learning to love the art of music.</p><br><p>Some of the fondest memories of my childhood involved the process of acquiring music, rather than listening to it. I enjoyed wading through search results for that one song I heard on that new site – YouTube – and clicking the download link. Occasionally, I had to open another browser tab, right-click, and click “Save As” instead, since some people preferred to directly upload mp3s on the website itself. Then of course, the importing! How I loved seeing that new song I’ve replayed countless times on YouTube pop up as a blank eighth note on iTunes, despite the hilariously common occurrence of the mp3s having improper labels for both song title and artist.</p><br><p>Putting it on a second-generation iPod Shuffle, my first ever music player, was even more cathartic. I didn’t need to rely on unstable prepaid dial-up (and later, DSL) internet anymore in order to listen to a song! I didn’t even have to rely on my family’s janky desktop computer, a hand-me-down from my mother’s office, in order to listen. I had everything at my fingertips now. And it felt pretty good!</p><br><p>It felt good to cycle through the songs.</p><br><p>It felt good to hear a newly downloaded song come up on the shuffled playlist.</p><br><p>It felt good to call myself a true “fan,” now that I’ve downloaded an artist’s songs.</p><br><p>I always used to pride myself, rather childishly, on how many songs I had on my iPod, since it felt like I worked for them. I conquered pages of search results, ungodly download speeds, and primitive pop-up ads in order to have these songs right here and right now. In a sense, finding good songs and being able to show them to friends conveniently was some sort of reward for my work. Superficial? Duh, but I was a kid!</p><br><p>The iPod Shuffle, and later the iPod Classic, were my most prized possessions. I couldn’t live a day without them, all the way until 2017, when my then-3-year-old iPod Classic’s headphone jack broke down.</p><br><p>Now though, it’s a different story. Today’s children don’t obsess over the number of songs stored on our music players, because technology has evolved to the point where we have infinite songs at our fingertips. Even in a developing country like the Philippines, mobile technologies and the cloud have advanced enough to enable music streaming, the iPod killer. Long gone are the days of slow internet and dedicated music players.</p><br><p>Is the death of the iPod, and other similar physical music players, a positive or a negative for our experience of music, especially for those in their formative years? The rose-tinted nostalgia effect may be in play here, but I can’t imagine a childhood where my listening experience was instant. Up to now, I still associate music with its instances outside of sound – the experience of both downloading, buying and ripping my favorite artist’s albums is completely different from simply listening to the album on Spotify. There’s a sense of realness, and the Internet in its infancy provided this, with the help of the iPod. Our iPod was the answer to the older generations’ LPs and CDs. More than anything, it served as a symbol for a more complete musical existence, in a time where portability was lacking. Anyone with an iPod was basically saying: “I love music so much, I want to listen to it, anytime, anywhere,” regardless of spatial limitations. That sense of specialness, however childish, however immature, is probably lost forever, ultimately exchanged for an even greater good: accessibility. Doesn’t mean we can’t miss the iPod though.</p><br><p>Spotify may have killed off the iPod, but the little device’s effects are still wide in magnitude. More than anything, I learned not to take music for granted.</p>"
},{
    "id": 25,
    "title":"The Art and The Artist",
    "date_published":" February 2, 2019",
    "credits":"Maiko Ng",
    "image":"\/images\/articles\/art.png",
    "content": "<p>The creation of art can primarily be ascribed to three elements—expression, profit, catharsis. A painting could have been brought about by thoughts and emotions; a sculpture by the desire to profit; a song as a release. Whichever it may be, stories are told; and it is through the telling of these stories that art, in particular music, has the capability of forming connections amongst people. Beyond that, it can be an instrument to spread ideologies and political views, and it is in this way that music becomes a double-edged sword. Because music has its own way of subconsciously getting into our heads (through catchy rhythm and lyrics), we sometimes find ourselves singing along even to protest songs such as Imagine (1973) by John Lennon and Spolarium by Eraserheads, even without the intention to. Nevertheless, pointing to this kind of music, it is still fairly easy to choose a side and express it—you either subscribe to the artist and his music or not. It is undoubtedly more difficult to draw the line, when we speak of artists whose political views we do not agree with, but whose music we love. We note here that their music does not necessarily reflect these political views.</p><br><p>I remember speaking to a friend once, and raving about Lea Salonga and her version of On My Own. He said: “But she is a Marcos apologist”. This shocked me as I knew that he was also a hard-core fan of Lea Salonga. What is even more puzzling is that none of Lea’s songs speak of, or at the very least, mention her political stance. If it were not for a heated Twitter debate, I would not have probably known. This leads me to think and question: Shouldn’t the artist be considered a separate entity from his music? Just as Roland Barthes argues in The Death of the Author, “a text’s unity lies not in its origins but in its destination”. By refusing to listen to someone’s music solely based on his political views (which are not even reflected in his music), do we not stray away from the purpose and essence of music? However, it seems that the concepts of purpose and essence cannot be explained using a single definition; they differ from musician to melophile, and from another. This is where we begin to question if my friend’s choice of boycotting Lea Salonga’s music really strays away from the “essence” of music.</p><br><p>We have been witnessing the boycotts of bands due to alleged sexual harassment cases (e.g. SUD from the UP Fair line-up, and Jensen and the Flips from The Rest Is Noise line-up). Here it is perfectly understandable to boycott because like what the UP Babaylan head Vince Liban said (on the reason of withdrawing SUD): “As an org who values and advocates for women and their rights, we cannot tolerate these kinds of behavior”. To retain bands who have a backwards way of thinking is to be silent and to implicitly accept such behavior as moral. Beyond this, boycotts and bans ideally function as a moral-corrector because they work under the assumption that bands or artists would not want their reputation to be tainted. Looking at it from this perspective, it sounds quite utilitarian, but if they work against and ultimately correct injustices then they are far better tools than silence.</p><br><p>Did my friend not boycott Lea Salonga for the same reason behind the withdrawal of SUD and Jensen and the Flips? Aren’t the two actions no different from one another? In a way, yes. That is because supporting artists may come in the form of paying for their music, and in turn this profit translates into their capacity to influence a crowd or generally widen their reach. Having this in mind, it is easier to understand why my friend boycotted; it must be because while Lea Salonga’s music does not compliment Marcos, she does and by increasing her profit (albeit minimally) through listening to her music, you may potentially support the spread of such ideologies. Yes, we listen to music for a myriad of reasons. For entertainment. As a connection. To experience joy, sadness, love. It is true that these are what music is for, but that is not the full picture. It is equally important to keep in mind the people and reasons behind the creation of music, so we can look beyond it—to its destination.</p>"
},{
    "id": 24,
    "title":"Fanciful Musings: A Whimsical Playlist to Get You Through Your Journey From Home to Katip",
    "date_published":"January 17, 2019",
    "credits":"Justine Faith Melgar",
    "image":"\/images\/articles\/katip.png",
    "content":"<p>Ahhh, the break’s almost over-- sweet, sweet rest leaves us once again as we count the days to summer vacation. At the beginning of the semester, we had Rec Week, a week-long celebration of Ateneo org life as ADMU students get to pick and choose their soon-to-be secondary barkadas. Well, fast-forward into the present and now we’re in Req. Week(s)-- req. short for requirements and that (s) is there because let’s face it, it takes all-nighters to finish them all. The Ateneo acceptance letter didn’t exactly come with a warning sign but then again, if most things in life did, then we wouldn’t be making as many unwarranted mistakes now, would we? Imagine how boring life would be then? In terms of music, what would artists write about? That thought alone could wipe out the existence of our beloved teen angst and emo bands. It would’ve saved me a lot of paper and ink used to write all those sad, sad thoughts as an emo teen but then again, I wouldn’t have had it any other way. I still have those notebooks… for creative reference.</p><br><p>Pretty soon, or depending on when you read this, it might be today that you’d have to start making the transition from reading your fics both from your traditional authors and fanfics (hey, there’s no judgment here) to your readings written by Dr. so-and-so about the Psychological Effects of so-and-so. Seriously, at this point, there should already be a study on the role interest has on information osmosis. Then, maybe readings won’t be as sleep-inducing. Imagine a reading a study filled meme references, fortunately for us, that might not be too far from now.</p><br><p>Droning on and on and on; university readings tend to have a certain effect on people, on me at least. It makes me sleepy in the middle of the day; after having just taken a nap; and in the mornings after a full 8-hour night’s rest when I get a nagging from my Ego to do something, anything academic just to compensate for letting the Id win the night before. No amount of coffee and god forbid I ever try energy drinks, seem to be able to combat the morphic effect of readings… especially *censored subject name* readings.</p><br><p>It’s awkward to think about how for having been such a neurotic high school student, the very trait that earned me my current status as an Atenean, I can’t now seem to tolerate stu”dying” for an extended period of time. Ever heard of the 80/20 rule? Well, I still practice it, though, nowadays, what that entails is 20% meticulous over-analysation of a particular page/paragraph/line and 80% lying unconscious on the desk, waking up with a paragraph of the reading’s 2nd page carbon copied onto my cheek-- along with the 60 other pages I’ve yet to read. In retrospect, it’s almost as if my former self actually did “die” in the high school grind.</p><br><p>I lost my mind</p><p>I don't mind</p><p>Where's my mind</p><p>Where's my mind</p><p>- bellyache by Billie Eilish</p><br><p>But alas, the awkward, pubescent past is now what it is; a thing of the past. College is here. And there is freedom to be utilised; a loosening of restrictions previously taut. College is now. And visualisation precedes experience.</p><br><p>Fanciful musings: simply a euphemism for escapism, really; but doesn’t it have a nice ring to it? Knowing that pretty soon I’d have to go back to my ‘university life’ makes it even more tempting. Especially now that I’ve spent the past month at my true home away from home (because this is where my cat is so I consider this city as my true home), I’m starting to feel the anxieties of once again having to readjust to the surroundings, the people, to the new surroundings that lack the people (and cat) I value the most. Well, if you’re anything like me, then, this playlist might help you get into the mood, a not-so-anxious mood.</p><br><p>This playlist offers sanguine beats to hopefully offset the dreariness off of those new set of depressing short stories your EnLit prof will once again require you to read (or is it just me?). It features songs from Bleachers, Will Joseph Cook, The Neighbourhood, and many more. The playlist is quite extensive with a total of 28 songs which should cover you for at least 1h 42 minutes of your trip back from home to Katip. And no, this is unlike those YouTube “Lo-fi Study Playlists” (I think?).</p><br><p>With that said I’d like to pay special artist mention to No Rome-- the fresh, new (actually, not-so-new but I still can’t get over his music. Stan New Rome!) Filipino artist signed under Dirty Hit (the same label as The 1975). Last October, he released the music video to his single “Narcissist (feat. The 1975)”-- and let me tell you honestly, it has been my LSS since it was released (still true). “Narcissist” is ¼ songs in his first EP under Dirty Hit titled “RIP Indo Hisashi”. And if I were to describe the album, let’s just say, it’s pop-alternative with a cinch of dreamy but not really. It’s colourful LED lights but turn the switch the other way and it's actually a blacklight. Don’t think I’m making much sense? Listen to the tracks then search up the lyrics. All 4 songs from the EP can be found in the playlist so, happy hunting!</p><br><img id=\"inline-image\" src=\/images\/articles\/katip2.png><br><p>As a final word: grit and patience, my fellow students. Remember, after Req. Week(s) also known as, the whole sem, we can finally jump on a car/plane/bus/train/jeep/tricycle (we’re all about transportation equality, here) back home. But for now, hello Katip! Please be nice to me! (I beg of you.)</p><br><p id=\"credits\">Illustrations by: Tina Valera</p><br><iframe src=\"https://open.spotify.com/embed/user/e7k88nf1jts7k0dffq7gioq06/playlist/1l6nWwenZTVlY7YnRFgv0i\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>"
},{
    "id": 23,
    "title":"2018 Album Lookback: Phantasms",
    "date_published":"January 15, 2019",
    "credits":"Arnald Paguio",
    "image":"\/images\/articles\/phantasams.png",
    "content":"<p>Appearances can be deceiving. While one can easily be swayed by the sunny guitar ripples and the relatable lyrics, Phantasms exhibits an allure that’s almost illusory; an ostensible charm that promises so much, but upon closer listen, only reveals the clutter beneath the glitz and glam.</p><br><p>This outcome could hardly have been predicted. The Strange Creatures has garnered a strong following since its inception back in 2013. Through a steady stream of singles (particularly the fan-favorite, Moonstruck), and the addition of dream-pop darling, Megumi Acorda, to the lineup, the band had created a significant amount of buzz around its impending full-length release. Upon its debut , it had seemed the album had lived to the hype, amassing much acclaim from local online publications and fans alike. However, this commotion around the album, to be quite frank, is all a bit baffling.</p><br><p>There’s no denying the talent within the group. In the opening track, ‘Moonstruck’, listeners are treated to a symphony of guitar lines that cascade to the backdrop of Megumi’s synth work. One can peer with wonder at the flex of skill, but as a whole, the individual parts feel a bit disjointed. It seems every member tried to cram in as many of the licks or tricks they know, without much care for the song as a cohesive whole.</p><br><p>Much of the same can be said for majority of the tracks in the record. This can be expected, given the band’s almost-formulaic approach to songwriting. ‘Stargazer’ and ‘Into Serenity’ are washed with guitar leads that wander aimlessly into the background, only to be forgotten. The tinny jangle of the acoustic guitar in ‘Into Serenity’ adds a nice rhythmic element, but lies too far in front of the mix, sticking out like a sore thumb.</p><br><p>This brings us to the crux of the record’s problem: the production. As pointed out before, each of the instruments felt disjointed, sometimes unpleasant. Particularly, the vocal mixing was unflattering towards the singers. In ‘Dreamy Eyes’, the vocals of the two singers were juxtaposed, with Megumi’s reverb-drenched voice responding to Jon Tamayo’s drier signal. An interesting idea on paper, but it failed to materialize in the song. The dissonance between the vocals felt awkward to the ear.</p><br><p>There are certainly highlights in Phantasms. ‘Palipad Hangin’ dazzles with its youthful energy, informed by the quirkiness of bands like Camera Obscura and Belle & Sebastian. In the track, the dynamic interplay between the instruments is a lot more apparent. The spunky mood of the track bellies the fragility of the lyrics (“Huwag mong daanin sa ligaw tingin/ Ako’y naghihintay lang din”), adding depth to the upbeat affair. In the same manner, ‘Mananatili’ starts off with playful guitar licks, followed by Tamayo assuring the listener with potent urgency (“Hwag kang matakot/ sasamahan kita). To cap off the highlights, there’s ‘I Feel Like I’m On Drugs’, which is arguably the strongest track. The song shows vestiges of Megumi’s fantastic debut EP, capturing the haze and fervor of her debut.</p><br><p>To sum it up, Phantasms is an album that loses itself in its ambition. It meanders towards dizzying heights but fails to stick a landing. While commendable, the execution leaves one detached from the work, mostly because of the production and lackluster songwriting. The record, however, speaks volumes of the group’s potential (as seen in the highlights of the album) and one should keep a look out for any successive releases.</p>"
},{
    "id": 22,
    "title":"First Reactions to First Reactions: Music As Spectacle and Hysteria",
    "date_published":"January 12, 2019",
    "credits":"Karl Estuart | Illustration by: Tina Valera",
    "image":"\/images\/articles\/spectacle.png",
    "content":"<p>BIGQUINT INDEED’s videos open with a warning: what you are about to hear is going to contain a whole load of bad words. If you can’t handle it, then it’s best for you to step away. It then cuts into a room, and Big Quint himself either seated or pacing around in tremulous anticipation for the Event: the music-listening. He tears the curtains down: “What up y’all, Big Quint,” extends into a monologue about the hitherto-unspoken expectations surrounding what is about to be experienced, and then he stops himself short so things can truly get going, gesticulating with his arms, a final warm-up routine before it all ends, a performance within a performance: “Let’s not waste any more mother****ing time. [artist name], [album title], first reaction, let’s (clasps hands together vigorously)****ing go.”</p><br><p>It is a strange phenomenon: we watch somebody get absolutely turnt (read: excited) to the music we love (or hate, or simply haven’t even listened to) rather than listening to the thing ourselves. Big Quint, in his well-viewed Kendrick Lamar reactions, rises up from his chair, jumps up and down, rolls his whole body around, even storms out the room when the song’s bass rattles the walls, and he howls with sheer fervor. He is gripped by the music, absolutely. As with Kendrick Lamar’s DNA, a song of grandiose proportions, he pulls himself out of the room, as though performing how the song pulled him out of his body, and the video abruptly cuts to him being back in the room (what happens between these cuts?), sitting back on his chair, and having it break under the weight of all the hype. “My chair – it broke!”</p><br><p>It is not a question of whether he is being genuine, or even if it truly is his first time listening to the music. In a sense, we know why we are here: to watch a performance. Big Quint is performing his listening. Rather, he is performing all of our listening. It is sheer energy, gratuity, flows of energy bursting at the seams. He channels something empty in us, or perhaps have lost – a reaction, a feeling. He shows us what to feel, how to feel it, and how much of it to feel. The grittiness of DNA almost seems unreal until Big Quint shows us so, hence the anticipation people accord toward the release of these videos, almost co-extensive with the release of the album itself. He shows us the music listening experience par excellence, limitless hype. It mirrors the critic-rating phenomenon, of review-aggregate websites telling us what to feel towards specific films and albums, but this shows us nothing new: we always follow a consensus. Our opinions have always been given to us. But when has this ever been the case for our experiences? And furthermore, what does this say about how we listen to music today, and of what we expect from our music?</p><br><p>Reaction videos, of course, only cover those musical movements that whip up cultural storms: hip-hop, contemporary R&B, and K-Pop, among others. There would be no conceivable reaction video, for example, to the latest art pop album from Julia Holter. And why should this be the case, besides the lack of wide appeal? Perhaps the experience which a Julia Holter album incites is not the type that ruptures forth from somebody, that could conceivably be watchable. A video, after all, is a spectacle, and the music reaction video is pure spectacle. A spectacle demands our attention from the first measure, pins us down by sheer force. There is something loud, almost violent to it. Something about it does not permit us to look away. Pulling us to look is some unnamed necessity that keeps us plugged in. And what if culture itself becomes a large spectacle, dragging us in without a clear out?</p><br><p>Spectacle, of course, is largely sustained by an illusion. It is bells and whistles, it hooks us, and it exists because it meets our desire to be entertained. Spectacles have been made for ancient kings throughout history. They require a suspension of reality – they are precisely unreal, a supposed break from a reality that is disjointed, beyond our control, and largely unentertaining. Yet here we find the ‘unreal’ to be a political qualification: most of the music which we would label as bombastic and unreal are inspired by conditions that are so extreme as to be unreal. Kendrick Lamar’s breakout album good kid, m.a.a.d. city, with kinetic flows and rolling beats, is interspersed with portraits of the grim reality of life in inner-city Compton – murder, gang violence, domestic abuse. The album itself seems to be an assault on the spectacularization of such life within mass media: that the fast lives and blazing cars portrayed in spectacular media endorses and even profits off lived realities of violence that affect real people and effect real deaths.</p><br><p>But allow me to elaborate on that spectacularization. Guy Debord, a 20th century French social theorist, made the following claim: “The spectacle is real.” It is not that we forget what is real. Rather, the spectacle itself becomes real. It replaces reality. Real life becomes organized and experienced like a spectacle, where experiences are expected to play out like the dramas that unfold on our screens. Everything plays out according to a formula, the images that we are presented with in media: relationships resemble those in rom-coms, bodies adhere to those in billboards and advertisements. Our very lives become spectacles, open for viewing by all who follow our Twitter, Instagram, and Facebook feeds. And music taps into the primal impulse of desire which fueled the spectacle to begin with: music is fast, loud, and perhaps overly dramatic, without any tendency for subtlety.</p><br><p>And what of music reactions, which was where we began? This current trend has twofold consequences, both for the reactor and the viewer. The reactor takes the music at face value: he harnesses the spectacle, the energy dormant in a track. The music effuses from his body. He embodies the spectacular: the sheer high arrested in Kendrick Lamar’s HUMBLE bursts forth from Big Quint’s body, his face contorted as though he were possessed, limbs and torso flickering on our screens. He surrenders himself to the music, and is assimilated into the spectacle. And as for us, viewers: we plug into the spectacle, as we already do every waking moment of our lives. Wired to the social network, we have little else to do. At the same time, the music listening experience is distilled to us: ecstatic, sheer release, pure feeling.</p><br><p>But the reaction video has unique consequences for the music experience: it is almost as if these YouTube music reactors listen to our music for us. Spectacles play out our lives for us, our desires playing out on the screens. Yet here we find a contradiction inherent to such a system: if the spectacle becomes reality, where did the previous reality go? Kendrick Lamar already gave an answer: it’s right there. It never left. People are still losing their lives. The spectacle functions by suppressing all ambiguity, all that is undesirable. It forces us to adapt to it, to wear our bodies thin to become desirable and to strain our eyes as we wait for new images to be delivered on our screens. As Bojack Horseman learns cruelly in the latest season, “the show must go on.” Yet if we take the spectacle at face value, it would certainly seem that it were reality. It becomes possible to imagine that the music reaction becomes the music listening experience itself, that we will soon forget the difference.</p><br><p>This may all seem excessively bleak, yet there is one crucial difference with the spectacle I have described and the spectacle we are all familiar with: we love the spectacle. We cannot live without spectacles; it nourishes our reality, enriches our inner lives, expands our possibilities. Kendrick Lamar knew this as well: the only way to be heard was by creating a spectacle. For such mediums, as history can attest to, are powerful channels for powerful messages, capable of rousing us to something much greater than ourselves. Kendrick Lamar’s career is a magnificent representative of the inspiration that a spectacle directed to humanistic ends can evoke. Affirmative, incisive, and ultimately joyful: like a world-historical speech being delivered to the masses, a spectacle guides us to our transcendence.</p><br><p>Big Quint, then, can be recast: he is a disciple to the prophets. Like an angel, he sings his praises without end. His videos are hardly reviews than they are worship rituals. We bask in the spectacle. It can renew our lives instead of taking over them. It can affirm life itself: that a beat can go this hard, that many people think the same, that many people can share that joy, embodied by that dancing figure who carries us onward, exhausts the music for all that it has, revels in all that which it can still give for repeat rituals, repeat listens.</p><br><p>There is a place in our lives for spectacles, when our lives are not reduced to them alone. For the flipside to such a reality is the patient, immersive slow burners, their little lights discernible only to those with the eyes to see, their little drones picked up by the ears that have learned to love silence. To put our senses to rest and allow the music to come through to us, as purely as it possibly can is meditation. Yet music reactors offer to us such a meditation that is anything but quiet, that is restless, purely engaged, even cathartic. Moments of wordlessness, utter reverence, such as when Tabby is pressed to his seat when the second half of SISTER/NATION comes on his Saturation III reaction: “You can tell when I’m ****ed up by a song when I’m not doing anything.” To stand before an artwork in its sheer singularity – or rather, to just catch all the feelings – is something we can learn from them as well. This moment comes only after Tabby has been thoroughly shelled out by the gauntlet of tracks that preceded this one, which finds him leaping, skipping, throwing pillows, making epileptic fits, and teasing hyperboles: “Best Saturation. Best cover, best beats, best production, best flows, best vocal mixing. Video’s over,” without even being through half the album. This tension between kneejerk receptivity and stunned veneration is the space of the encounter with music today, and perhaps with all art, a direct rupture in the endless everyday stream of images which Roland Barthes calls the puncture, through which we learn to take up arms and live. In other words, if you’ve ever thought a song has changed your life, then you should listen to that thought. Never let it go. Let it break out of you, a spectacle among spectacles.</p>"
},{
    "id": 21,
    "title":"2018  Album Lookback: Ballads 1",
    "date_published":"January 10, 2019",
    "credits":"Anton Tablante",
    "image":"\/images\/articles\/ballads.png",
    "content":"<p>The sad bedroom pop indie boi movement is really taking the global music industry by storm. We’ve got a holy checklist for this burgeoning genre:</p><br><p>[ ] Layers over layers over layers of reverb?</p><p>[ ] Sad lyrics about love?</p><p>[ ] Soft-spoken, ASMR-level singing voice?</p><p>[ ] Simple beats over a couple of piano notes?</p><p>[ ] Bucket hat?</p><p[ ] Light-wash bootcut dad jeans?</p><br><p>To caricaturize this image is not hard.</p><br><p>In fact, Joji (also known as George Miller, Filthy Frank, and the Pink Guy), tries to subvert this so-called subculture in his debut album, BALLADS 1. Joji is no stranger to this form of genre-perversion; his Youtube personality Filthy Frank was (was) engineered around atypical shock-and-awe gags, aiming to achieve some kind of “alternative comedy.”</p><br><p>In BALLADS 1, he attempts to establish himself as not only a kind of post-modern virtuoso, with mastery over meta-commentaries in both comedy and music form, but also as a solid musician in his own right. With the same tools: lush instrumentation, a soft singing voice, and themes about love and loneliness, Joji tries to twist the genre around and present his own, unique, RnB-influenced take on it, while poking fun at the same time.</p><br><p>Unfortunately, the LP falls short at being a cohesive package of ideas. Joji’s vocals are decidedly lackluster - in songs such as “Yeah Right” and “Why Am I Still in LA,” the vocals feel like lazy efforts that were done in one take at the recording studio. His languid, closed-mouth manner of singing blends together with the oft-simple, 1-2 beat in the background. Now, this could be a good thing if his singing voice was actually interesting to listen to - trip-hop bands and artists such as Portishead attempt to blend the voices in with the “wall of sound,” a huge mis-mash of reverberated sounds from numerous instruments. but the difference is that James Blake’s voice carries a lot more weight than Joji’s. Someone like Blake has exact control and mastery over his voice - he knows when and how to modulate his voice to match the so-called “wall of sound’s” peaks and valleys. In contrast, Joji’s reverberated mumble-singing simply serves to alienate the listener. Lyrics are delivered without impact, because all too often the words just simply mush together into an incoherent mess of alphabet soup.</p><br><p>However, we do see glimpses of Joji’s potential vocal artistry. On the best song off the LP, “No Fun,” the reverb is washed away, in favor of a vocal track that clearly stands in the foreground of the song. Straying away from the formulaic, hazy beats that mark the rest of the album, Joji then proceeds to absolutely belt it in a banger of a pop song, accompanied by simple finger-snapping and synth hits. He shows the same quality of voice on “Slow Dancing in the Dark“ and “I’ll See You in 40,” with “Slow Dancing in the Dark’ being an emotional, crooning love ballad that just explodes, and “I’ll See You in 40” being a hip-hop/RnB-hybrid, with wind accompaniments during the intro and outro that serve to both raise and lower the curtains on a story.  If he were able to populate the album a bit with songs such as these, the album as a whole would’ve been a lot more balanced, as the album would contain a mix of slower songs that show off Joji’s lyricism, as well as faster, hip-hop type tracks that can show off Joji’s vocal chops.</p><br><p>Instead, the whole album, production-wise, feels like a wall. Producer-Joji and the guest producers do a good job with the beats, with artists such as Shlohmoh, Thundercat, and Ryan Hemsworth being featured, and the mixing is tight - the bass in “Can’t Get Over You” is one of the best of the year.</p><br><p>The problem is that songs often blend together, becoming nigh-indistinguishable sequences of hazy noise, with mumble-singing as the cherry on top. The songs on their own are fair listens - the aforementioned “No Fun” and hit single “Slow Dancing in the Dark” are glimpses into the high level of production Joji is capable of, but the album fails to have a solid vision for its songs. While the LP may have a solid unitary lyrical theme - love and all its pitfalls - the songs all feel like they’re just Joji pleading his romantic cases, or complaining about a flame, burning or not.</p><br><p>She don't wanna tell lies</p><p>- “Test Drive”</p><br><p>I've been waiting my whole life</p><p>To know I wanted you</p><p>Are you feeling me slowly?</p><p>- “Wanted U”</p><br><p>Won't you come through?</p><p>Water on me</p><p>We gon' walk right through</p><p>- “Come Thru”</p><br><p>BALLADS 1 stands as a mediocre debut offering, which can be aptly described as a mere collection of songs rather than an album. However, BALLADS 1 definitely has cracks of potential. Joji shows his talent in production throughout the LP, and if he gets a few lessons in singing and sprinkles in a touch of variety, watch out.</p>"
},{
    "id": 20,
    "title":"Rites of Passage Vol. 2",
    "date_published":"January 5, 2019",
    "credits":"Arnald Paguio and Enzo Tan",
    "image":"\/images\/articles\/vol2.png",
    "content":"<p>The sixteenth of November was poised just like any other Friday night. Both north and  southbound Friday night traffic were burning, while Route 196 stayed still, unassuming. Had you gone an hour early, you would’ve had no clue of the night to come. By eight o clock,  a rush of people gathered by the front desk, and those manning the desk had trouble keeping up. The artists had arrived at this point as well, all armed with smiles tinged with a hint of nerves.</p><br><p>For some of the artists, Rites of Passage was their first plunge into the world of gigging. Route slowly filled up, which probably didn’t help with the gig jitters, but surely hyped them up as well. In no time, the venue was buzzing with excitement, with everyone just raring for the program to start. Save for a few technical difficulties, Rites of Passage Volume II was finally underway. Hosts Marga Magalong and Athenna Bigornia were met with a rapturous roar from the crowd. The fantasy had begun.</p><br><img id=\"inline-image\" src=\/images\/articles\/vol2_2.png><br><p>Our night began with acoustic pair, Cañao. They kicked things off with a cover of George Ezra’s Paradise. Instantly, the crowd was met with lush vocal harmonies and intricate guitar work. All eyes on the indie-folk duo, Cañao allured with their earthy and bare sensibility. The spectators swayed along to the sounds that recalled the mountain ranges of Ilocos Norte the duo grew up with. Though a bit timid initially, their voices soared higher, with the guitars following suit. The duo then kept rolling out the covers, showing the breadth of their influences. From The Paper Kites to Hozier, it was clear what Cañao was going for. The set was serene, yet vulnerable all throughout.</p><br><p>The next set of performers was a change of pace, to say the least. Mojo, from the get-go, oozed with charisma. The band jokingly busted out Bohemian Rhapsody at the start of the set, which was probably a cheeky reference to recent release of Freddie Mercury’s biopic (with the Mojo’s frontman dressed up as Freddie himself). Jokes aside, they carried this swagger throughout the performance. Mojo takes pride in its funk and jazz influences, with the band flexing their instrumental prowess in full (and funky) effect.</p><br><p>There certainly was hype for the next artist, Anja Javier. The O-Idol participant’s stripped-down take on electro-pop had created a bit of buzz around her. Utilizing live-loops, she builds songs from scratch, slowly building them from the ground up. Her renditions of It’s Strange by Louis The Child and Movie by Tom Misch were stripped bare, taking out the unnecessary. Still, the songs maintained their alluring quality. Occasionally, Anja would showcase her skill on the keys, particularly when her hands glided through octaves on Movie. Much of this skill took the back seat, however. The song always came first for Anja. After the covers, she finally played a couple of originals. Once again, Anja played much to the same vibe, but the originals were much more revealing, more potent. From pulsating bass lines to pearly key jabs, Anja flashed her versatility—and the crowd was loving it.</p><br><p>Where earlier act Mojo took funk vibes to a fever pitch, Morobe internalized their groove into a sultry, jazzier movement. They opened with a belting cover of UDD’s Sana, and followed with a line of originals. In a fashion reminiscent of somewhere where The Internet meets Santana, the lineup of veteran AMP musicians entranced the crowd in a groovy haze. The piano was whole bodied in shouldering lead singer Laean Angeles’ melodies. Her voice carried pain, but not sheer sadness and anger, but agony that strengthens and fortifies the worn soul. Their sound, as exemplified by the electric riffs, was a bright-eyed, jumpy take on murky sorrows. Route 196 was lit on fire by the end of their set as each member had his/her own moment to shine in a solo of his/her own. Slapping bass, ripping guitars, soulful piano, and banging drums: each hit and note sent the crowd in a frenzy to cap off Morobe’s set.</p><br><img id=\"inline-image\" src=\/images\/articles\/vol2_3.png><br><p>The first rock outfit of the night was Cheshire, comprised of older AMP members. With bangers up its sleeve, Cheshire was ready to rile the crowd up. Opening with the Cranberries’ Zombie, the members were fittingly clad in black (and eyeliner to match). The whole venue was bopping to the riffs and hard drumming. When the drummer started the classic intro drum sequence of Sugar We’re Goin Down, Route 196 was sent into rapture. Like punk gigs of old, the band incited a mosh pit. Some audience members even had to go outside to take a breather—it was that intense. The onslaught went on with a faithful rendition of Paramore’s My Heart and a thrasher take on Dangerous Woman. At this point, the venue was hot and heavy from all the jumping and sweating, and it was crazy to think the night was far from over.</p><br><p>The Quirks was welcomed with laughs as they took to the stage with printouts of the penguins of Madagascar taped on their shirts, and clout glasses on the drummer. Gimmicks aside, they cut right to business with their alternative rock sound. Pulsing guitar riffs and rolling drums characterised their set with a screaming, even roaring energy. The Quirks take elements of pop punk and washed over them with a distinctly OPM touch; a little like if Tanya Markova played Weezer. Admiration, then Ashtray were two originals they played that illustrated the coming-of-age soundtrack vibes they embodied, or why they’d fit in a Tony Hawk game playlist. In the middle of their schoolboy-romance tunes came another show of their humour with a snippet of Madagascar’s I Like To Move It. The Quirks, with their, well, quirks, showered Route with their infectious danceable rock tunes, and left everyone in a sweat.</p><br><p>In a fashion we can only describe as hyperkulit, Serotonin lived up to their name with their uptempo, loud, gritty synth-inflected rock. Playing all originals, these boys had the crowd soaring with their wide, vast soundscape of harmonic guitars and hip-swaying swing. Their vocals are equal parts suave crooning, and gritty growl, akin to Neon Trees’ Tyler Glenn. Despite Serotonin leading the Rites audience in their striking blend of The Killers and Last Dinosaur influences, the highlight of their set was their original Slow Down, which, as the name suggests, a well timed break from their breakneck tempos. It was a soothing balled delivered by a steady, counting guitar; quite reminiscent of something you’d hear at your prom. Their last song, in its dreamy fever, featured an interlude mix of Nadarang and Stupid Love by way of an alternative act you’d hear on FIFA.</p><br><p>Our night was rounded out by the well-anticipated rapper J-Coasta, who everyone in the room was well aware of. After releasing his own mixtape, the aliased Jasper Acosta didn’t play around. In no time, he unloaded banger upon banger with favorites such as his commanding Bounce On Your Feet, and a requested a capella rendition of Big **** Syndrome. J-Coasta played his own beats on his programmed iPad on stage as he spit his verses. Interestingly, he employed a mix of multiplex vocals and live layering over himself. This was an ambitious attempt at replicating his studio sound of tough gangster trap, which he killed. It was his confident grip on the mic, as well as his proud demeanor, that proved that J-Coasta was indeed a developed showman who craves to entertain.</p><br><img id=\"inline-image\" src=\/images\/articles\/vol2_4.png><br><p>Rites of Passage: Volume II was indeed a fantastic trial by fire for this year’s lineup of neophyte acts. Veteran, or newbie, what was clear was a consistent love for all forms of music and putting on a show for the yearning crowd. Volume I and Volume II - we had two nights for the books, witnessing the greats do their thing, and shred their hearts out the whole time.</p>"

},{
    "id": 19,
    "title":"Celestial Bodies: The Auditory Galaxy of Milo Heraldo's Katawang Langit",
    "date_published":"December 23, 2018",
    "credits":"Danie Cabahug",
    "image":"\/images\/articles\/katawang_langit.png",
    "content":"<p>Milo Heraldo strings together an auditory galaxy in his debut EP Katawang Langit. Released in December of 2017, the 20-year old singer-songwriter’s self-produced release features an earnest four-piece compilation, exploring the spaces between sayang, sana and muntik na. The album is peppered with familiar narratives, from sweet-nothings, to the familiar pangs of love, longing, and loneliness.  It’s particularly the real and the raw that comprises Katawang Langit.</p><br><p>The EP comes to life with “Sansinukob,” the first of four tracks that brings us into Heraldo’s ‘universe’ of celestial bodies. Punchy and energetic, Sansinukob sets the tone for the rest of the album, rife with tropes of the cosmic. The imagery is stark, the first few lines drawing us into the all-consuming space left by the absence of a loved one, familiar Fender riffs cutting to a pre-chorus with a charged urgency. (“Bakit ‘di na lang na maging tayo? / Ang mga liham na hindi naaabot sa’yo”)  begs the pre-chorus, hitting us with the kind of longing we’ve all experienced, and whose throes inevitably echo throughout the rest of the EP.</p><br><p>Slowing it down with Talanyo, Heraldo’s second track takes a turn for the acoustic, consistent with the EP’s overall thematic. Translating to constellations, the track is anything but dazzlingly brilliant. Instead, what Heraldo offers in Talanyo areis no frills-vocals laden over acoustic guitar. The result? Uundeniably honest ‘OPM,’ reminiscient of  the sensibilities of Rico Blanco and Eraserheads. As Heraldo explores a more intimate atmosphere in the acoustic take of Talanyo, the slowness of the track dangerously borders sluggish — a lackluster embodiment of the movement from resignation to resolve in rising above the fears, challenges and immediacies of romance in the name of young love. Played live, Talanyo becomes a refreshing breather of emotion coupled with the backbone of the drums in the band setting.</p><br><p>The album genuinely picks-up momentum in the latter half, with jazzier influences shining through in Malintala. As if to parallel the upturn of the EP, the track is playful in exploring the restlessness of staying in a lover’s good graces: (“Di na alam pa’no babalik / Sa tamis ng iyong lambing.”). Malintala is charismatic in its attempt to convince—to ask for consideration. (“’Di mo ba alam na ikaw lang naman talaga?”) reads the last line of the chorus. It’s indubititably caught up in the familiar movement of the “push” and “pull,” the gut-wrenching pursuit of love and its sweet serendipities that we chase almost in intoxicated delirium. These make manifest as Malintala is able to hold its own, in tasteful iterations of the trumpet ringing out to cut and complement resonant vocals, all steered by and held together by the beat of the drums.</p><br><p>Bulalakaw brings the album to a close, and aptly so. The fourth track is a lighthearted take on stolen moments, wishful thinking, and transience to boot. In three-and-a-half minutes, Heraldo paints a picture of beauty, grounding the image in the anticipatory wait (“Para kang bulalakaw / At hinihintay ko ang iyong pagdating”). The vision is enrapturing, (“Binihag na naman ang puso / Nawawala ako sa tono / Sa tuwing kumakanta sa tabi mo”) seizing one almost as if in a trance with its catchy beat, vocals all too inviting of sing-a-longs, and lyrics to latch onto.</p><br><p>Katawang Langit does well to explore the real and the raw neatly and succintly. The 20-year-old singer-songwriter’s freshman release proves to be testament to the coming together of various influences. It chooses not to subscribe to a single genre, but to includehas distinctly ‘OPM’ undertones in its short repertoire. Taking the form of the celestial bodies, the EP ultimately serves as an ode to the beautiful, articulated in a cosmic retelling of the quintessential boy-meets-girl fairytale.</p>"
},{
    "id": 18,
    "title":"Rites of Passage Vol. 1",
    "date_published":"December 22, 2018",
    "credits":"Jude Buendia, Luisa Jocson",
    "image":"\/images\/articles\/vol1.png",
    "content":"<p>By the time November rolls around, the Ateneo Musicians Pool (AMP) hosts its much-awaited, annual Rites of Passage. This year’s Volume 1 was held last November 3 at crowd favorite Mow’s along Matalino Street, where rookie bands and performers come together in a baptism by fire, claiming the stage and proving if they have the chops or not.</p><br><p>First blood of the night was four-piece band Seizure Salad, which performed an array of punk, pop rock, and indie tunes. They opened with an electrifying cover of “Hybrid Moments”, pumping up the crowd with an abundance of guitar riffs. Despite just being a year old, the band performed a number of originals: “Waterway”, “Zombies” and “Plans and Trips”, with each track leaving the crowd head-bobbing from start to finish.</p><br><p>To slow things down, Sab’s Boys took to the stage with their heartfelt serenades. The band self-describes their sound as a mashing of “sadness and sorrow into rock and roll”. Taking on a much more mellow atmosphere, Sab’s Boys crooned and sang their hearts out to an achingly sentimental performance worth swooning over. From an affable cover of “Picture Picture”, to favorites from My Chemical Romance, Sab’s Boys gave a performance laced with all sorts of feelings: from love to heartbreak, and everything in between.</p><br><p>Taking things in another direction, the next performer of the night was The Gafs, a quirky set of members who describe themselves as a band that does not “give a truck”. Their performances were, put simply, all over the place – but in the best way possible. From an eclectic opening number of “Bad Romance”, to a mash-up of Rihanna classics, The Gaf gave a performance that left the crowd electrified. Special mention goes out to their surprise skit that eventually led up to a banging rap medley. No trucks given, indeed.</p><br><p>With the night still young, Rites still had 4 performing acts remaining in store for the audience. Next was The Blanks. The four man band got the crowd singing with their set of Arctic Monkeys songs such as “R U Mine” and “Hellcat Spangled Shalalala.”. The crowd loved The Blanks as they performed a lot of their original tracks such as “All I Want”, “Miss You,” and “Red Tides.” These are three songs one should quickly search up on his/her Soundcloud right now. Certainly, The Blanks had Mow’s fall in love with them.</p><br><img id=\"inline-image\" src=\/images\/articles\/vol1_2.png><br><p>‘Lil Hicci got the crowd going with his flow of raps and beats. One of the solo artists of the night, his rapping and mixing skills got the audiences stunned. His performance imbued Mow’s with a chill, almost zen-like energy. A star-in-the-making, ‘Lil Hicci is a musician poised to go go very, very far in the rap world.</p><br><p>Following was the last band of soloist musicians for the night: TALA. Opening their act with boy pablo’s “Everytime,” the crowd was left mesmerized in a flash. They soon showed their masterful skills by performing a mash-up of Ben&Ben’s “Maybe The Night” and Up Dharma Down’s iconic “Oo.” Taking the audience by surprise, their next songs were “Lover Boy” by Phum Viphurut and Rex Orange County’s “Best Friend”. Their rendition of Arctic Monkey’s “Fluorescent Adolescent” was very popular amongst the crowd as well. The band had everyone in Mow’s at the ready, their hands with the audiences chanting for one last performance. And, they did with a small snippet of Daniel Caesar’s “Japanese Denim”, ending their amazing set.</p><br><p>The first night of Rites was certainly a blast for everyone at Mow’s. Capping off the night was AHJU$$I, the last solo artist for the night. The last people standing at Mow’s were seen dancing and jumping around with AHJU$$I’s well-crafted mix of different, eccentric, popular and indie music. Armed with a video-game guitar, AHJU$$I ended the night with aplomb, giving the audience an eclectic, sample-filled set. Definitely a crowd favorite.</p><br><img id=\"inline-image\" src=\/images\/articles\/vol1_3.png><br><p>Rites is always one of the most-awaited AMP events.  The set performances of different rookie acts never fail to mesmerize both old and new members, no matter the time, no matter the place, no matter the music. With the performances showcased tonight, the future of AMP is looking up.</p><br><p id=\"credits\">Photos by: Miguel tarrosa and Maiko Aira Ng</p>"
},{
    "id": 17,
    "title":"Rites of Passage 2016: Kremesoda",
    "date_published":"December 2, 2018",
    "credits":"Anton Tablante",
    "image":"\/images\/articles\/kremesoda.png",
    "content":"<p id=\"credits\">(c) Daphne Rubio</p><br><p>Duds Mitra and his band Kremesoda are the prototypical new kids on the block. Fresh out of Xavier high school, the band brings their smooth style and even smoother sound to AMP. Seeking improvement and connections, the band looks to a bright future in college.</p><br><p>I got the opportunity to interview Duds, the lead guitarist, about his band. Their current line-up is: Roberto “Toots” Orosa, the lead vocalist and rhythm guitarist, and Lan de Lara, the bass guitarist. Duds mentions that the band is currently looking for a drummer, as their high school drummer, Austin Chua, is studying abroad in Canada.</p><br><p>The predecessor to Kremesoda was formed in Grade 6, when Duds, Toots and Lan were classmates. “Toots, Lan and I, we were classmates in Grade 6 and we just started out acoustic jamming lang in the classrooms,” Duds mentions. Kremesoda officially formed when Austin joined the trio in a Bandfest before their Grade School graduation.</p><br><p>Kremesoda, a rather interesting name for a band, came from a snack session the band had in Austin’s house. Austin’s parents are Canadian immigrants, and one of Canada’s premier products is the soft drink cream soda. Duds recalls, “We were somewhat petty and childish back then, so we decided, whatever, let’s name our band Kremesoda.” Even if Kremesoda was named after a mere soft drink, I find it a very appropriate band name for their sound: delicious and addicting.</p><br><p>Speaking of their sound, Duds gave a great description: “Our old songs, like our first song Torpe, was super pop.” One listen of the song and some of the succeeding songs on their SoundCloud confirms this. The band was really inspired by several AMP artists, most notably She’s Only Sixteen and their hit song Dying to Meet You. Listening to the band’s SoundCloud, the band’s early songs did give me a really SOS-vibe, but it was refreshing to see that they evolved ever since their high school days.</p><br><p>“Right now, we’re really influenced by indie bands like The Strokes, Arctic Monkeys,” says Duds. He says that they are trying to shift more to an alternative genre of music, shying away from the sugary pop they made in high school. Their relatively new song Talk¸ up on their SoundCloud, is a step forward in this direction, as the band sounds more mature and more suave on Talk than on their old songs.</p><br><p>AMP gives the neophyte band a great opportunity in the form of gigs, and Kremesoda is understandably very excited. The opportunity to perform in pubs and other music hotspots across Metro Manila is very hard to come by if you are a high school band, so I can definitely understand this excitement. “We have barely any experience of gigging in local pubs. [We performed in] school events lang,” says Duds. As of now, however, the band’s immediate priority is fielding a solid line-up with a drummer. Their songwriting process is quick and easy, the only problem is making time for it.</p><br><p>For Rites of Passage 2016, Duds had this to say, “We’re just looking to get our sound out, straightforward. It’s all about the sound naman eh.”</p><p>He got that right. Kremesoda is all about their sound, a sound that definitely should not be ignored. With massive tunes and refined confidence, the new kids on the block are not to be underestimated.</p>"
},{
    "id": 16,
    "title":"OPM – What is it and why is it dead?",
    "date_published":"November 13, 2018",
    "credits":"Sofia Guanzon | Illustrated by: Tash Parayno",
    "image":"\/images\/articles\/opm.png",
    "content":"<p>You’re in the car; switch the radio to a random local station and an American pop song croons about unrequited love. You open your phone, go on Twitter, and scroll through the masses of 280 character bits of people’s lives, filtering through the hot takes and glazing over their experiences. You’re half-interested but really, you’re just doing this because you’ve been conditioned to use your phone during idle time. Then a tweet pops out in particular and suddenly you’re a witness to the death of an entire art form. “OPM IS NOT DEAD. There are so many new artists you should listen to. It never died!” a tweet reads, black characters glowing against the stark white screen. You hear the American pop song playing in the background and think: maybe it is?</p><br><p>OPM or Original Pilipino, Pinoy or Philippine music is a movement, genre, nuisance—however you’d like to define it, that has been a topic of much debate over the past few years. With the rise of this notion that ‘OPM is not dead’ on the internet, it sparks even more discourse on the implication that it ever ‘died’.</p><br><p><b>Etymology and origins of OPM</b></p><br><p>Historically speaking, the term OPM was said to have been coined in the late 1970s by Danny Javier of APO Hiking Society, preceded by the term “Manila Sound” which was also popularized in the seventies. The two movements coincided with one another as the musical landscape began to shift from public friendly Americana disco mania, characterized by artists such as Hotdog, VST & Co, and The Boyfriends to a more Filipinized take on pop rock music with Tagalog being the main language of expression. Arguably, Manila Sound was already “OPM”, however, OPM was a more inclusive term that contrasted the Manila-centric limitations of calling Filipino music just Manila Sound. Juxtaposed by the cultural context of Martial Law in the seventies, there seemed to be a need to Filipinize our art as a way to claim our national identity during a time when the strength of the Filipino and Philippine society was being destroyed by a dictator. These distinct terminological turning points in Philippine music history established that the music we were creating was never simply a Filipino take on Western music  — it was emerging to be something we were doing on our own.</p><br><p>From the seventies to the eighties came the rise of ballad, rap, and rock music making their way to the public sphere through the radio. The eighties and nineties bore witness to the rise of subgenres such as alternative rock, headed by bands like the Eraserheads, Parokya ni Edgar and Rivermaya; simultaneously, soloists like Gary Valenciano and Regine Velasquez were serenading the country with their love ballads. While on the opposite side of the spectrum, Francis Magalona and Andrew E. were trailblazers of the Filipino rap scene in terms of bringing the previously lesser known subgenre into the mainstream. Considering the definition and purpose of the term, along with the musical landscape of the time, these artists and the music they made are undoubtedly OPM.</p><br><p>It is only now; that OPM’s validity as a collective term, movement, or genre is being questioned. Previously, there was no set sound for OPM, there hadn’t been such growth and development in Filipino music prior to the eighties and nineties, when the ‘genre’ was fully fleshed out. The way these artists made music led them to define a standard and style of OPM, and in turn popularized the sounds that we most commonly associate with the genre today. From the seventies to the nineties and even the early 2000s, there seemed to be shared sentiment that all Filipino music—popular and independent — was OPM. However, the industry and the way music is promoted have changed. These transformations have ushered in a proposition of whether the labels we have created are still applicable to the current state of our music scene and if the artists can still prescribe to it.</p><br><p><b>Concretizing ‘OPM’</b></p><br><p>The term ‘Original Pilipino Music’ already poses a terminological problem that lends itself to be dissected in ways that divide creators and consumers alike. Who has the monopoly over what is defined to be original? What does ‘Pilipino’ entail—the language, the artist, the country? What kind of music is encompassed here and can new artists who don’t prescribe to the traditional sound of OPM be part of it? Having the term be in English already adds another dimension to the problem of imposing a foreign tongue on what is meant to be an umbrella term for music made by Filipinos, for Filipinos. Its dichotomy of being either genre or movement is also always in question. Defining OPM as a genre implies that there is a certain criterion that must be accomplished for it to be considered as part of such. Defining it as a movement implies that there is an agreed upon cause or goal being set into motion through the creation of this art. This plurality of interpretations is a common phenomenon ingrained in our culture. Our national identity and what it means to be Filipino is still being debated over today, and this lack of cohesion trickles its way down to defining our subcultures and art.</p><br><p>There are those who insist that the term has grown obsolete. Some artists say they feel constricted by the term, that it specializes Filipino music to be a certain way and hinders them from progressing artistically. One of the most common arguments for abolishing the term altogether stems from comparison with other countries not having specialized terms for music of their own. It’s simply called their music. If music is made by a Filipino in the Philippines, surely it shouldn’t be necessary to specifically call it ‘original’ or ‘Pilipino’ at all.</p><br><p>In spite of this, there are also those who don’t necessarily think that the term poses any extreme limitations on artists. After all, it is a very Pinoy quality to use one specific term to collectively classify, like how we refer to Colgate as the general term for toothpaste when it’s a specific brand. In that sense, OPM is a familiar cultural concept that bridges music to the masses. Artists and fans can contest the label of OPM as much as they want yet at the end of the day, Filipino music is pooled altogether under this term because it has been convenient and apt for us until this point.</p><br><p>As for the question of who can be part of OPM: if any Filipino can be considered part of it, even those who grew up abroad—it’s all rooted in our definition of who is Filipino in the first place. Like most things in our culture, it’s all a matter of our own experiences. Filipino artists who make music actively keep their national identity alive and intact through their art and contribute to creating this national heritage. That is an act of being Filipino in itself.<p><br><p><b>Here lies OPM</b></p><br><p>So how does one declare an ultimatum on the lifespan of a people’s music?</p><br><p>OPM has been subjected to a sentence of antiquation ever since the previous sounds associated with it had fallen out of popularity. Although, the problem does not solely lie in the term itself. Mediums evolve, and the processes and patterns that come with being an artist must adapt with the times. The main difference with how artists in the past were able to achieve success in the market compared to today lies in the methods through which they put out their music. Artists who made it big in the past were invested in by large record labels who provided them with the resources to fully develop their vision, the sound they wanted to create, and the narratives they wanted to set across. Commercial record labels of today typically sign solo artists who are either already established actors or starlets who have already been launched into the industry. There is also a risk of sacrificing their own personal vision in pursuit of reaching nationwide success. This led to a shift in preference for artists to create music on their own terms.</p><br><p>With this ‘death’ of OPM, there are specific artists who gain popularity and give a face to modern Filipino music. Usually, you’d see a comment or two on their Youtube videos, where people would be relieved to see that OPM really isn’t dead. IV of Spades, Ben & Ben, and Reese are just some of the artists who are commonly named as saviors of OPM through statements defending that it ever died. A commonality between these artists is that their unorthodox sound doesn’t prescribe to the sound that the Eraserheads pioneered or that APO Hiking Society popularized. It’s new, it’s current, and it’s groundbreaking to those who have never been directly involved with the music community to witness the blossoming of these new artists. Just as anything in the music scene, it’s all about the fans—and they have spoken. Whether you agree with the sentiment that there are certain artists we can pin as messiahs of our music or not, that’s not the message. It’s more of a testament to the response an artist can get today, if their music was more accessible. One artist’s success only elevates the community as a whole anyway. Maybe if every artist was invested in commercially and promoted better, the notion that OPM ever died would have never been a topic of discussion.</p><br><p>The independent music scene is where most artists who don’t abide with the current system of the industry operate in today. The term ‘independent music’ or ‘indie music’ is constantly misused as a genre as ‘indie’ may also refer to an artist not prescribing to the previously defined musical genres. Although in that way, that may be a style or genre in itself. Terminological complications and categorical confusion aside, artists are now choosing to make music in a more niche way that does not appeal to the general public - making their music independently gives them the avenue to do so.</p><br><p><b>A systemic change</b></p><br><p>Globalization and the internet have completely revolutionized the way we consume music. Internet culture has cultivated the rise of producers and beatmakers – artists who can now create entire albums and distribute them right from their bedroom without the additional involvement of a company to be the channel between them and the industry. Music streaming is now the most popular form of accessing and listening to music through websites such as Soundcloud and Spotify. In comparison to how artists were marketed in the past, this new system is not the most inclusive approach to accelerate one’s success here in the Philippines.</p><br><p>Perhaps this is where OPM’s death begins—; with the metamorphosis of how we distribute and consume music.</p><br><p>Here in the Philippines, the radio and TV are still the most effective mediums through which new artists are given exposure and can assimilate into mainstream music. By giving artists the opportunity to be heard and be accessed to on a larger scale, this gives consumers the space to simply be fans. Exposure through television shows, promoting on radio or even mall shows may be an outdated way to reach out to their audience but these are the methods that resonate with Filipinos. The internet can only do so much and only reach a certain population. These platform changes have led to the idea that OPM ever died since we didn’t really hear Filipino artists on the radio as much as we heard Western artists.</p><br><p><b>A eulogy to OPM</b></p><br><p>Technicalities aside, OPM actually might be dead. Its previous incarnations, that is, have died and in turn have paved the way for new subcultures and new techniques of producing music. In the years that people have declared it to not be dead, it seems to be more of an issue of a popular sound to hit plateau rather than it actually ‘dying’.  With the spotlight shifting focus to more famous international pop artists who have the means to market themselves extensively, especially online, our homegrown acts seem to have grown within the smaller independent music community instead. Gig culture—another subculture stemming from the independent music scene, brings us more intimate and personal ways to fully immerse ourselves into the scene. In contrast to colossal concerts in arenas, gigs bring the artists to the forefront in a less formal setting. Usually organized by a small group of people, gigs are also the main way independent artists get their name out there. Any gig, from Katipunan to Makati, will assure you that our music is very much pulsing with life, the artists and members of the independent music community have just taken matters into their own hands.</p><br><p><b>A call to action</b></p><br><p>We can’t antagonize people who thought OPM was dead when all they heard on the radio was Ed Sheeran. Filipinos love what’s popular, what’s cool, what’s trending and what is popular, because what’s cool and trending is dictated by the media giants who control what the average citizens hear on their way to work. We also can’t villainize the artists who feel offended or limited by the term. That’s their personal experience and the best we can do as a nation, as a music community, is to listen to their stories.</p><br><p>So the next time you see another eulogy to OPM online and you find yourself mourning as well, let it rest in peace. To some people, it never died. To others, it did, and we are now in an era of OPM Renaissance. Music is all about your personal experience and, terminological discourse aside, as long as a Filipino has something to say through a song, all other elements are secondary. At the heart of the industry is being a fan, enjoying the stories artists have to share, and talking about these opinions and experiences. OPM is about your personal experience with Filipino music; and as to whether this term benefits our music in the long run—I hand the pen over to you now for you to contribute to the discussion.</p><br><p>Okay, enough talking. Turn the music back on.</p><br><p><i>The views, thoughts, and opinions expressed in this article belong to the author, and do not reflect the thoughts and opinions of the Ateneo Musicians' Pool as a whole.</i></p>"
},{
    "id": 15,
    "title":"The Lyrical Prowess of Lorde",
    "date_published":"November 7, 2018",
    "credits":"Luisa Jocson",
    "image":"\/images\/articles\/lorde.png",
    "content":"<p>Born Ella Yelich O’Connor, the 22 year-old grew up in the suburbs of Devonport, New Zealand.  Tracing back her family background and history, one can already testify to her inclination towards the written word. Lorde’s mother, Sonja Yelich, is an award-winning poet, and thus, she grew up in a household that valued literature. Lorde began reading a wide range of genres - at the tender age of five, she had developed impressive public speaking skills. As a young teen, she began perusing the books of J.D. Salinger, Kurt Vonnegut, among other literary nobles, and famously proofread her mother’s masters’ thesis for her. This early cultivation of a cultural repertoire is instrumental in Lorde’s development, both as a person and as a songwriter.</p><br><img id=\"inline-image\" src=\/images\/articles\/pure-heroine.png><br><p>Fast-forward into the future, and Lorde’s hip-hop infused debut album “Pure Heroine” cemented her as a pop icon with its ‘so-over-it’ attitude, while sophomore album “Melodrama” sashays into her discography with its reckless ballads and “galloping crescendos” as critic Kitty Empire best puts it. Melodrama is anything but mellow, and gung-ho on the drama – and dare I say, danceable? Regardless, Lorde doesn’t lose herself, and in fact, she gets even better.  We see her growth in a span of just a few years, from the gritty, minimalist “Pure Heroine” evolve into “Melodrama”, which is colored by her experience with her newfound fame, and her reflection of her life now. These changes are also clearly seen in the evolution of her writing.</p><br><p>Delving into the work of Lorde, imagery is quite an essential to her style of composition. The natural poet that she is, Lorde has tended to conjure very precise, somewhat harrowing images and metaphors.</p><br><p>“Green Light”, for example, is one standout from the album. The adrenaline-filled, pumping ballad uses compelling imagery. While one might attribute the green light to being associated to a “go signal”, it might also stand as an image of F. Scott Fitzgerald’s elusive green light in ‘The Great Gatsby’.  The green light at the end of the dock is an important image throughout the novel, symbolizing Gatsby reaching out for his dreams and desires. An iconic snapshot of the novel portrays Gatsby standing by the dock, staring out at the green light, longing for something so near, yet so far. The entire song captures the yearning of something greater that Lorde has been aching to contain.  The buildup of the song is ostensibly one of her finer songwriting moments – from her lashing at her lover: “I know what you did, and I wanna scream the truth”, to a poignant admission of her inability to accept things: “Oh, honey, I’ll come get my things, but I can’t let go”, to a brazen, but stunning realization: “I hear sounds in my mind/ Brand-new sounds in my mind” – the song is a whirlwind of tumultuous emotions.</p><br><img id=\"inline-image\" src=\/images\/articles\/lorde-portrait.png><br><p>“Well those rumors they have big teeth,” (Green Light), “You drape your wrists over the steering wheel / Pulses can drive us from here” (400 Lux),  “Dancing around big eyes” (Team), and a personal favorite: “I’ll see the veins of my city like they do in space” (Tennis Court). One could only imagine Lorde seated in an airplane, peering out the window, and seeing the rows and lines of unfurling city scrapers, attributing it to such an image – veins.</p><br><p>“Tennis Court” is another example to her masterful songwriting. Its hypnotic, head-bobbing beat is accessorized by a magnetizing use of internal rhyme: ‘Because I’m doing it for the thrill of it, killing it / Never not chasing a million things I want’. This makes for a smoother sounding flow that wraps up well and is gratifying to the ear.</p><br><p>Lorde has also perfected the craftsmanship of making catchy one-liners.  From rattling and rapping away signias of opulence in “Royals”, she’s able to seize that recklessness one can only associate to the youth. She sings in “Team”: “We live in cities you’ll never see on screen, not very pretty but we sure know how to run things.”</p><br><p>Her emotions are bubbling and seething, and it pours forth in her music. As she croons in “The Louvre”: “I call and you come through / blow all my friendships to sit in hell with you”. In “Supercut”, she talks of a lost love: “These visions never stop / these ribbons wrap me up / but when I reach for you / there’s just a supercut”, which paints a clear, but panging image of how one cannot resist returning to an old flame. The same song is able to evoke feelings of entrancement: “We were wild and fluorescent / come home to my heart”. “Hard Feelings/Loveless” shares similar sentiments on glitches with love in  “Supercut”: “Cause I remember the rush / when forever was us / before all the winds of regret and mistrust\". These are only a few examples, but they’re enough to show how Lorde is an artist of nostalgia and emotion. Her sentiments are so raw and real, and she laces it in such unapologetic, honest writing.</p><br><p>Whether you’re a fan or not of the eccentric synaesthete that is Lorde, her ability is unreckoned. The lyrical powerhouse proves you don’t need to be highfalutin to be a good songwriter, as her words (which are all too familiar) have captured a certain artfulness that is well beyond her years.</p><br><p>Today’s mainstream pop scene can be easily characterized by flighty, party-crazed dance tunes that are more than happy to boast about senseless opulence. Most listeners have made themselves quite comfortable with such a set-up: of singers crooning about the same old things, about the same old people, with the suspiciously same old beats.</p><br><p>Enter Lorde - the gothic, witchy songstress who dominated the pop charts before she turned seventeen, and has cemented her name in the mainstream industry forever. One might think a young girl like herself would be impressionable enough to fall into the sticky trap of the business’s glamour, but think again. Lorde shocked the world with her refreshingly honest music that rebelled against the traditional tides of pop, but shockingly, made it a defining genre unto herself. Beyond her hypnotizing synths and carelessly carefree attitude is arguably the crown jewel of her entire career: her songwriting.</p>"
},{
    "id": 14,
    "title":"Okatokat: Your 'Spooky' Halloween Playlist",
    "date_published":"October 28, 2018",
    "credits":"JF Melgar",
    "image":"\/images\/articles\/spook.gif",
    "content":"<p>Do you believe in ghosts?</p><br><p>Maybe, maybe not but it wouldn’t hurt to be extra cautious with Halloween being just around the corner. Corners, beware of dark ones for, in the movies, they hide the unrestful souls of the ones with unfinished business, emotional baggage. Back pain? Make sure you’re not unknowingly carrying dead weight. And speaking of weights, beware of wells. I don’t trust the water down there; if it is <i>just water</i> down there.</p><br><p>Do you believe in ghosts?</p><br><p>Maybe when you were younger; I used to. As a child, I was a perpetually scared and yet a stubborn enthusiast of paranormal fiction. As a result, I avoided going anywhere dark alone, actually, anywhere alone in fear of ghosts like Toshio jumping out from some dark, forsaken corner. Although I haven’t seen many wells in my lifetime but in the few occasions that I did, I avoided going near them at all costs. And don’t get me started about the movie, Shutter. It made me question all the bodily aches I’ve ever had.<p><br><p><b>Parokya ni Edgar’s</b> song, <b>Okatokat</b> (which is pig latin for Takot Ako), perfectly encapsulates that excessively jumpy behaviour one tends to adapt after watching a scary movie. In the song, Chito sings about instances in which he thought he had encountered the paranormal but as it turns out, in one case, it was just his mom and not a White Lady; and in the other, it was only his reflection.</p><br><p>Do you still believe in ghosts?</p><br><p>Not anymore, I presume. I don’t anymore. If you are quite the horror enthusiast as well, at some point you would’ve watched one too many horror movies that you notice the same three plots playing out: the abandoned house with the murder backstory plot, the acquiring of haunted item plot, and the ouija/possession plot. Honestly, I never got the <i>Conjuring</i> series hype. You may disagree but I don’t recognise anything new or fresh about them; all of the movies in that series still fall within the same three plot cliches.</p><br><p>Of course, there’s the less-appreciated monster genre and no, the good ones are not all only about zombies. Wes Craven’s 1984 film, <i>A Nightmare on Elm Street</i>, is a cult classic. If you haven’t seen it, I won’t spoil it but to give you an idea of what it’s about, listen intently to the introduction of <b>My Chemical Romance’s</b> song, <b>Sleep</b>. By the way, good luck on getting any of that if ever you do watch the movie.</p><br><p>What are you afraid of?</p><br><p>Listening to <b>Marilyn Manson’s</b> version of <b>This is Halloween</b> from Tim Burton’s <i>Nightmare before Christmas</i> is nostalgic but the song’s description of monsters from Halloween Town don’t necessarily “make you jump out of your skin” anymore.</p><br><p>t’s Halloween season but as a university student, that also means that it’s midterm season, which is also lovingly known as hell month. Here is a likely scenario:</p><br><p>Jamming to <b>Emperor’s New Clothes</b> by <b>Panic! at the Disco</b> at 9PM, you start off with high spirits as you prepare for an all-nighter by drinking a cup of coffee as you lay out the work you need to do for that night. At 12AM, you’re listening to <i><b>Follow You</i></b> by <b>Bring Me The Horizon</b> and wondering if the lyrics, “my heart feels like a ghost”, possibly foreshadow the palpitations you’ll be experiencing later for drinking this much caffeine. At 3AM, if you’ve managed to stay awake, you find yourself singing <i><b>Halik ni Hudas</i></b> by <b>Wolfgang</b> at the top of your lungs (at least in your head so as not to wake up the household) with the passion of a friendship scorned. You hiss once the sun starts to rise, not only because you’ve now become highly sensitive to the light, but also because that means that this paper is due very soon and you’ve written the conclusion but there are some body parts missing, <i>phantom limbs</i>. Do this for several nights and the bags your under your eyes start growing darker by the week. You don’t really notice it until one night, you give yourself a fright in the bathroom mirror as you mistake your reflection for the ghosts from your childhood. Okatokat.</p><br><p>What are you afraid of, now?</p><br><p>Sinister, sinister forces that have taken the form of pieces of paper namely, LTs, midterms, reports and, synthesis papers bearing a grade you would love to bury 6-feet underground. Seeing the letter C, except it has a vertical spine and the gaps are closed so it looks more like a D, on the paper you worked tirelessly for nights on end. Decimal-level fluctuations in your QPI, <i>period</i>.</p><br><p>If you’re a freshman newly adjusting to the grooves of university life, living alone and far away from home, you might find yourself identifying with <b>Paramore’s</b> song, <i><b>Ain’t It Fun</b></i> on a whole new spiritual level.</p><br><p>I’m sure you would agree that it could be fun to be <i>on your own</i>; it could be fulfilling to become independent and <i>count on no one</i>; but <iliving in the real world</i> is an adjustment that takes time. Hang in there, little fish.</p><br><p>.</p><br><p>.</p><br><p>.</p><br><p>If you’re planning to have one of those all-nighters this Halloween/midterms/hell month season, you might be interested in giving my playlist a listen. And as for my final remark, look for it in the playlist. It’s a very important reminder. Happy hunting!</p><br><br><p>The Spotify link to the playlist:</p><a href='https://open.spotify.com/playlist/5SDNKEYMYpI0HEbFAu5F8s'><p style=\"color:black\"><u>https://open.spotify.com/playlist/5SDNKEYMYpI0HEbFAu5F8s</u></p></a>"
},{
    "id": 13,
    "title":"The Last Dinosaurs' Yumeno Garden Falls A Bit Short",
    "date_published":"October 27, 2018",
    "credits":"Arnald Paguio",
    "image":"\/images\/articles\/last_dinosaurs.png",
    "content":"<p>Last Dinosaurs is a band that thrives on formulas. Yumeno Garden sacrifices innovation for consistency, not straying  from the pop-rock sound that filled the airwaves during the turn of the 21st century. With the current landscape of indie rock dominated by the resurgence of 90s DIY sensibilities, Last Dinosaurs offers a sound that’s relatively prehistoric, but can charm any devoted fan into a state of euphoric nostalgia (or nurse anyone else to sleep).</p><br><p>The first four tracks hark back to the Australian band’s previous records, with the opener, “Eleven”, sprinting from the get-go. The driving beat of the opening sequence sets the tone, as lead vocalist, Sean Caskey,  starts the song off with its main hook. Yumeno Garden is fully equipped with arena-ready hooks, ready to be sung by a crowd. In blistering fashion, the next three tracks blaze through your earphones, often catching you out-of-breath. “Then all my problems kick in, just like dominos” screams Caskey in the chorus of  “Dominos”, as his brother, Lachlan, sings along with the crunch of his angular guitar-work. “Bass God”, the best cut of the record, is carried by Lachlan’s pulsating guitar riff, which rips through Sean’s reverb-laden vocals and the arpeggiated synths. For much of the first four tracks, the lead guitar practices restraint, carefully placing itself within the mix, with every note elevating each arrangement and creating moments to remember. In the track “Sense”, Lachlan juggles a variety of lead tones per section of the song, particularly the opening riff, which mimics the sound of the marimba—a welcome reference to the band’s classic track “Andy”. Lachlan then caps the track off with a guitar solo that embodies the lovelorn angst of the song’s lyrics.</p><br><p>The rest of the album tells a different story, however. Much of the energy from the opening four songs is lost, with the band opting to further explore the atmospheric leanings of their second project, “Wellness”. The loss of their former drummer, Dan Koyama, is most felt in this section of Yumeno Garden. Koyama’s funk-tinged, idiosyncratic drum-fills played a crucial role to the band’s early sound and are sorely missed in the record. In “Happy”, the band delves into the realm of bedroom and synth pop, with Lachlan taking a much more reserved role. The lyrics are self-deprecatingly aware, yet unimaginative—a barrage of synths and drum sequences can only do so much to mask the tedium . Up next is “Forget About”, which plays to the same tune, as its mellow pace and murky production enchants you into a dream-filled trance that sadly leads to slumber . Yumeno Garden then trudges along the next four tracks nonchalantly, as only Lachlan’s lead work can salvage any sliver of  worth from the album’s hazy remnants. “Non Lo So”, the album closer, is an ode to the current trend of psychedelic pop popularized by Mac DeMarco, and while it does  intrigue with its loose song structure, the song  essentially leaves one drowsy by its sluggish contentment.</p><br><p>For the avid Last Dinosaurs fan, this album will not disappoint. The uncanny J-rock flavored pop rock sound  familiar to the band is still very much present. Despite Yumeno Garden being the band’s  first self-produced effort, the album is their most professional sounding release to date. Years of experience shines through in the production, but that alone can’t make up for the lackluster songwriting—barring the first four tracks. In its wake, Yumeno Garden is a fan-pleaser that reels you in with its plethora of hooks and riffs, but ultimately leaves you underwhelmed.</p><br><p>Favorite Tracks: Eleven, Dominos, Bass God, Sense</p>"
},{
    "id": 12,
    "title":"On Dawn, J-Coasta Reminds Us Why He's Called The Realest In His Most Versatile Album Yet",
    "date_published":"October 24, 2018",
    "credits":"Robert Kwan Laurel",
    "image":"\/images\/articles\/dawn.png",
    "content":"<p>Within the Ateneo there are few homegrown artists currently as well-known as Jeremy Jasper Acosta, AKA J-Coasta. Often referred to as “The Realest”, there are many who question the rapper’s place in music. Despite this, the prolific rapper has been in the game for quite a few years now, and it doesn’t look like he’s stopping anytime soon. In January of this year, he released his long-awaited sophomore release, Dawn.</p><br><p>In Dawn, J treads upon new ground, exploring different ideas and sounds within his songs. The album starts strong with the titular “Dawn”, wherein Acosta’s repeated refrain about rising up above the sun is intersped with lyrics about his journey as an artist. Of all the lines on this album, one line from this song really struck me: “I’m proud that I have a single parent”. Acosta raps backed by beats of modern trap-influenced production. The song ends with a call back to one of his first songs, “The Realest”, where the motif of  “J-Coasta the realest” is interpolated near the end of the song to truly drive home the journey that he underwent.</p><br><p>Listening to this album changes your very concept of yourself. When we listen to good music, we never really stay the same person. We share the experiences of innumerable people through the thousands of songs that we listen to throughout our lives. This is the point of the album at its core. J shows us how he reaches for his dreams in a way that is so driven it almost makes you want to become a rapper yourself. When he tells you to “rise like the dawn”, you almost feel a sense of wonder well up inside you. A sense of wonder all too often lost in our world today.</p></br><p>Another highlight on the album would be “Ballin’ Like My G”, which is my personal favorite song on the album. Here, Acosta talks of his aspiration to ball like his “G”. Who exactly this refers to is open to interpretation, be it the name of a person, God, or simply an expression of passion.</p><br><p>When talking about this album, the production needs to be mentioned. Out of all the tracks I think his production shines the most on the track, “Laf Trip”. Here, the song shifts between different phases building up to a cascade of synths. While the song isn’t as personal or emotional as his others, it’s one of the most fun songs of the year. And sometimes, fun is all you need.</p><br><p>“Beauty & the Beast” may be one his most self-aware songs yet. Here J professes his love to a girl with a “hot body with decent personality”. We can admit, his emphasis on a hot body over a good personality is something very prevalent in our world today. Yet, J is not immune to these faults himself. This prioritization of the outward over the inward is something very primal, which may be the reason for his referral to himself as a “beast”. However, we may also interpret this as the word beast in hypebeast culture, a culture heavily associated with rap. This double meaning is all very ironic, and the song as a whole serves as a critique to our culture, while still serving as an honest profession of love.</p><br><p>However, where J-Coasta reaches highs with his production, he also falls short. While his production is quite novel and interesting at times, it can start to feel stale and too similar by the midpoint. The bass is too overblown at points, the drums are tinny, and there isn’t much deviation from generic rhythms. In “The Dream”, the backing track only makes the constant repetition of “the dream” even more jarring. Then there’s “Standing Ovation”, which is the usual song where J calls upon a girl to “clap that ass”, while not necessarily a bad subject, it doesn’t really do anything new with a tired topic.</p><br><p>A lot of tracks fall somewhat in the middle. \"Villains” and “Give Me Some Love” while good drag on by the end, “All Good” could have used more emotional and clear vocals, and “The Dream” is an ok track but doesn’t really finish the album off well.</p><br><p>Overall the album could have used more direction and editing, as it feels very bloated at times. I wish that more time was spent on each track, even if it meant a shorter album. The bonus tracks that come with the physical and online copies of the album don’t exactly help this case either.</p><br><p>Often people say that J-Coasta isn’t a serious artist, but how do we truly classify art as “serious”? They say his flow is bad, his lyrics are dumb, or that his voice is distracting. While I do agree that technically there is a lot to be improved on, I say that this isn’t the only point of music. We create music to express our passions, fears, and dreams, and Dawn has that in spades.</p><br><p>J isn’t afraid to be vulnerable in this album. His thoughts are bare and naked. While many in society find such nakedness unusual and laughable, it is with this very nakedness that we are born, and it is with this that we will die. Our own identity is something that most of us can never truly define. Who are we? What do we do? And why are we here? By our very nature, we are doomed to never find this out. Yet, when we reflect close enough. We might get a faded snapshot of who we were at one point.</p><br><p>The reason that we look back fondly on our youth is not because of who we eventually become, but because of who we eventually did not become. The possibility of the future scares us, yet it is when we are scared that we truly know something is happening in our lives. Dawn captures this very lightning of youth in a bottle. It poses us with the question: where would we be now if we unabashedly followed our dreams the way J did?</p><br><p>If one day you go to the Ateneo, you may find yourself walking around its halls. A diverse crowd full of possibilities will engulf you like clockwork, every time the bells ring. Yet through the sea of people, there stands one man. A man who stands proud knowing that what he does is real, and that in the end, that’s all of him that will remain.</p><br><p>Best Tracks: Dawn, Ballin’ Like My G, Beauty & the Beast</p><p>Worst Tracks: Standing Ovation, The Dream</p><br><p>Rating: 3/5</p><br><p>Image source: https://soundcloud.com/d_j-coasta/sets/dawn</p>"
},{
    "id": 11,
    "title":"TUBE Throwback: The Subculture of Rave in 90s Manila",
    "date_published":"March 9, 2018",
    "credits":"Marga Magalong",
    "image":"\/images\/articles\/rave.png",
    "content":"<p>For us millennials, the culture of house music has been handed to us on a silver platter. If you’re 14, you'd go to an open party and the self-made DJ transitions Martin Garrix to The Chainsmokers – only for sheer accompaniment to your T-Ice and freshman naiveté. Or maybe you were a 10-year old kid forced to dance along to Benny Benassi’s Satisfaction for intrams. It is debatable whether acts like The Chainsmokers really is house. The point is, you have been living among the many by-products and vague sub-genres stemming from the influence of house music; more specifically, the influence of the subculture that was rave.</p><br><p>At present, if you're aching to hear quality-driven electronic music, you could easily look up the gig sched of your patronized disc jockey and book an Über to Black Market or TodayXFuture. What a time to be alive! Manila nightlife is not so much of a monopoly as it used to be, with an enticing platter of bars, warehouses, and clubs, you won’t have to drag yourself to over-saturated EDM Meccas like Pool Club. However, for the Gen-Xers of 90’s Manila, it didn’t come easy. If you wanted to hear Mr. Fingers and other authentic house from hubs like Chicago or Manchester, it’d be an impossible feat to hear it play in your local club.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave2.png><br><p>In the late 80’s to early 90’s, notable lounges and clubs like Euphoria or Mars would attract teenagers dressed in their Ralph Lauren while playing songs from the Billboard Hot 100. Many attempts were made to provide fresh house music by organizing raves, but no other production pulled it off quite how Consortium did.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave3.png><p id=\"credits\">(The guys of Groove nation, circa 1998)</p><br><p>A week ago I sat down to interview Toti Dalmacion: to many youngins he is the man behind Terno Recordings and This Is Pop! Records, but try asking your tita who he is and you’ll get nostalgia-ridden answers of Toti’s past-persona. In the 90’s, he was known for his record store Groove Nation and his spearheading of raves by Consortium. He once called himself “The Prophet of Doom”, remembering being irritated by the lackluster quality of raves upon his arrival from L.A. to Manila. The word “rave” had been loosely used to throw parties typical in the Manila fashion of sosyalan. Toti tells me, “No one was really dancing. It was more of to be seen, with music in the background and people just nodding their heads and drinking.” This was until he formed Consortium, “a roving underground party” aimed to push the envelope for raves in the Philippines – to make it less about high society and more about the music.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave4.png><p id=\"credits\">(Derrick May at one of the Consortium raves)</p><br><p>Back in L.A., Toti frequented underground warehouse parties. He had met legendary house personalities, such as Derrick May and Marques Wyatt, and went to raves being busted by cops. He was enthralled by the whole scene, and upon going back to Manila he was itching to bring Filipinos what he had experienced.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave5.png><br><img id=\"inline-image\" src=\/images\/articles\/rave6.png><br><p>Consortium was notorious for hosting raves in off-the-wall venues. One of which was a warehouse in Star City, gracing legendary acts like Doc Martin and Ken Ishii.</p><br><div class=\"video\"><iframe width=\"840\" height=\"473\" align=\"middle\" src=\"https://www.youtube.com/embed/1mh_tkQdH84\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div><p id=\"credits\">(Ken Ishii's set for Consortium, 1996)</p><br><p>“We did it at the Shangri-La Mall food court when it wasn’t even a food court yet,” Toti recalls. Other venues were the Philippine Daily Inquirer warehouse, and the most notable one, a rave in the National Library.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave7.png><p id=\"credits\">(The flyer for the National Library rave)</p><br><p>“Malate was THE place then for bohemians and similar tribes if you wanted to escape the Makati crowd,” he tells me. Here, the guys of Consortium would give out flyers pointing out directions to when and where their next rave would take place.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave8.png><br><img id=\"inline-image\" src=\/images\/articles\/rave9.png><br><p>In a sense, Consortium had been a maverick in shifting Manila youth culture to a whole new direction. What set it apart from clubs like Euphoria was that Consortium wasn’t tied down to giving into commercial song requests. They played what they wanted to play, and the rest of Manila followed.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave10.png><br><img id=\"inline-image\" src=\/images\/articles\/rave11.png><p id=\"credits\">(Havoc's QC store)</p><br><p>Consequently, the culture of Ralph Lauren polo shirts had been subverted and retired in exchange for local streetwear. Nearby students would hang-out in the Robinsons Galleria shop of Havoc Street Couture by Adam de Lumen. Staple rave fashion would be bought from brands like Grocery in San Juan, owned by Cecile Z., a regular of Consortium herself.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave12.png><p id=\"credits\">(Grocery, 220 Pilar Street, San Juan)</p><br><p>“The youth culture changed in a flash. We suddenly felt that being different was not all bad but rather more fun. Street fashion became the voice of every Filipino youth dying to break the stereotype. In that brief period, we became exposed to a new lifestyle that changed our music, style, and way of life forever,” says the unnamed author of the blog ilove90sfashion.wordpress.com.</p><br><img id=\"inline-image\" src=\/images\/articles\/rave13.png><p id=\"credits\">(Hello Kitty Fashion Show at Fashion Café, 1999)</p><br><p>As time progressed into the new millennium, house music had met its many mutations in the form of “deep house, tribal house, Jackin’, etcetera […] As well as the proliferation of the more commercial Eurodance, prog house, trance” and of course – EDM. The use of techno and house had trickled from raves to nation-wide commercial use, spanning from barangay Christmas blow-outs to noontime shows. While the ravers of the 90’s grew up, millennials took helm of house music’s fate by attending festivals like CloseUp Forever Summer and popularizing the sound of EDM. The times they are a-changin’, and consequently one issue arises: Do millennials know their house?</p><br><img id=\"inline-image\" src=\/images\/articles\/rave14.png><br><p>Toti cynically tells me about the spoon-fed marketing that goes with artificially inseminating an idea of house music to millennials and popular culture. “They just go by what Beatport says […] Because, yeah, you have the internet. You can research and research for hours – but to really train your ears on the really good underground stuff is not really something most do because, that’s what I’m saying: It’s always spoon-fed. Beatport says, [these are] the top 100 house tracks, when you know very well, if you listen to them … some of them aren’t even house or techno, it’s just that they are marketed as such.”</p><br><img id=\"inline-image\" src=\/images\/articles\/rave15.png><br><p>The real issue here is for millennials to stop confusing what’s house and what isn’t – but house or not, it’s important to keep the legacy of Consortium by breaking the monopoly and celebrating diversity. It’s 2017 and as a millennial, it feels good to be able to choose what to listen to and where to go for the night.</p><br><br><p id=\"credits\"><b>Sources</b></p><p id=\"credits\">Information:</p><p id=\"credits\">Dalmacion, Toti. Personal interview. 21 Dec. 2016.</p><p id=\"credits\">Dalmacion, Toti. “Drowning in My Nostalgia.” Blog post. The Simple Yet Complex World of The Collector. N.p., 21 Oct. 2008. Web. 30 Dec. 2016.</p><p id=\"credits\">“Wreaking Havoc Once upon a Time When We Were Young.” Blog post. We Wreaked Havoc Once Upon A Time. N.p., 10 Mar. 2013. Web. 30 Dec. 2016.</p><p id=\"credits\">Sorrenti, David. “15 Nostalgic Manila Rave Flyers from the 90-00’s.” Pulseradio. Pulse Radio, 16 Feb. 2016. Web. 30 Dec. 2016.<p id=\"credits\">Photos:</p><p id=\"credits\">“A Last Chance to Make Memories at the InterContinental Manila.” The Lost Boy Lloyd. N.p., 21 July 2016. Web. 30 Dec. 2016.</p><p id=\"credits\">Where did the 90’s go?. (2015, September 6). Mimi & Juliet Tan [Photo album]. Retrieved from https://www.facebook.com/pg/WhereDidThe90sGo/photos/?tab=album&album_id=1023969774301612</p><p id=\"credits\">Where did the 90’s go?. (2013, February 23). Grocery [Photo album]. Retrieved from https://www.facebook.com/pg/WhereDidThe90sGo/photos/?tab=album&album_id=538284419536819</p><p id=\"credits\">Where did the 90’s go?. (2013, February 23). Havoc Street Couture [Photo album]. Retrieved from https://www.facebook.com/pg/WhereDidThe90sGo/photos/?tab=album&album_id=538287306203197</p><p id=\"credits\">“The Kids of Havoc.” Blog post. We Wreaked Havoc Once Upon A Time. N.p., 9 Mar. 2013. Web. 30 Dec. 2016.</p><p id=\"credits\">“Wreaking Havoc Once upon a Time When We Were Young.” Blog post. We Wreaked Havoc Once Upon A Time. N.p., 10 Mar. 2013. Web. 30 Dec. 2016.</p><p id=\"credits\">Dalmacion, Toti. “Drowning in My Nostalgia.” Blog post. The Simple Yet Complex World of The Collector. N.p., 21 Oct. 2008. Web. 30 Dec. 2016.</p><p id=\"credits\">Sorrenti, David. “15 Nostalgic Manila Rave Flyers from the 90-00’s.” Pulseradio. Pulse Radio, 16 Feb. 2016. Web. 30 Dec. 2016.</p><p id=\"credits\">Videos:</p><p id=\"credits\">Ken Ishii@Groove Nations CONSORTIUM 1996 Shot of Koro and Wall Graphics. Dir. Toti Dalmacion. Perf. Ken Ishii. N.p., 15 Apr. 2009. Web. 31 Dec. 2016.</p>"
},{
    "id": 10,
    "title":"Music and Infinity in the Sampling Machine",
    "date_published":"March 9, 2018",
    "credits":"Lorenzo Escober",
    "image":"\/images\/articles\/pablo.png",
    "content":"<p>In 2009, when shutter shades were still cool and you downloaded all your music through LimeWire, The Black Eyed Peas released their fifth album, The E.N.D. The record hasn’t aged particularly well; it represents that awkward transitional period between 2000s EDM and the more polished electropop of today.</p><br><p>The reason I begin with this lukewarm, time-capsule of an album has less to do with its content than with its vision. will.i.am described The E.N.D. as “a diary [...] of music that at any given time, depending on the inspiration, you can add to it. I'm trying to break away from the concept of an album. What is an album when you put 12 songs on iTunes and people can pick at it like scabs? That's not an album. There is no album anymore.”</p><br><p>Though The E.N.D. was a huge commercial success, it failed to make the slightest deviation from the static, structured format it aimed to derail. It followed the typical pop album trajectory; recorded, promoted, and eventually forgotten. Nothing was ever added or revised, nothing about it seemed groundbreaking or innovative. Indeed, the only thing will came through with was that The E.N.D. had 15 songs instead of 12.</p></br><p>But will.i.am’s concept trickled into the murky depths of the pop cultural subconscious, faintly surviving as a residual idea and emerging much later as a formidable one. It may have seemed pretentious or even laughable at the time, but will.i.am latched onto something when he spoke of albums that grew even after they were released, of sound that was dynamic and infinite.</p><br><p id=\"quotation\">\"But one thing I am not annoyed by, and in fact welcome, is the idea that The Life of Pablo will never actually be finished.\"- Winston Cook-Wilson</p><br><p>The idea of adding to an existing record, editing it, polishing it, and allowing consumers to experience it immediately was a feat most notably pulled off 7 years later when Kanye West uploaded revisions of The Life of Pablo to several streaming services.  He called it a “living, breathing, changing, creative expression.” Winston Cook-Wilson of Inverse praised it as “evidence of Kanye’s particular, thoroughly contemporary genius […] Everyone is paying attention, and engaging with this album—over time rather than all at once—thanks to the rapper’s disruption of the ephemeral hype cycle.” Jayson Greene of Pitchfork, however, warned that “If The Life of Pablo continues to drag on indefinitely, it seems likely that the magic will start to drain away.” Love it or hate it, Kanye actualized an exciting concept: the idea of sound evolving, mutating, and refining itself, coming into its own and creating a self-contained universe.</p><br><p>But do we really need to look solely at album formats and marketing tactics to find examples of a sound that is boundlessly sprawling and privy to incessant alteration? Of course not.</p><br><p>The notion of a sound that is alive and self-reflexive is present today more than ever in popular music. It is what Frank Ocean does when he modulates, reproduces, and alters his voice, turning it into its own instrument. In his most recent release, a you-didn’t-know-it-would-work-until-you-heard-it cover of Moon River, Ocean utilizes the effect he discovered in Blonde and turns his voice into a soundscape that stretches towards infinity. With one voice, one note even, Ocean can create a discordant choir of Oceans, which dialogue with one another.</p><br><p id=\"quotation\">DJ Shadow knows what it's like to wander through that basement, find some buried treasure and resurrect it for millions of listeners, like an irrational God on beats 'n breaks Judgment Day.- Chris Dahlen</p><br><p>Sampling is an older, even better example of a sound that echoes without becoming myopic. The genre of hip-hop was built upon it, from Chic’s borrowed riff in Rapper’s Delight to Kendrick Lamar’s backmasking of 24k Magic in Loyalty. In sampling a previously released song and allowing it to live again, artists liberate that sound from its predetermined confines, permitting it to breathe anew. The selection doesn’t even have to make sense—look at how SZA turns Justin Timberlake’s Set the Mood into a hauntingly melodic refrain in The Weekend, or how Drake got a sleepy one-hit-wonder song from 1972 (Timmy Thomas’ Why Can’t We Live Together) and cooked up Hotline Bling. Sampling confirms what we knew all along about sound: that it bore infinite capacity. In her gushing appraisal of Darren Aronofsky’s polarizing horror film mother!, performance artist Marina Abramović said that “a good work of art has many lives.” The music sample embodies this brilliant insight, its lifespan is endless so long as DJs and producers continue reshaping those records.</p><br><p>The effect of sampling is, to appropriate a term used by literary critic Mikhail Bakhtin, heteroglossic. Several voices are invited to interact on a track that lives and breathes. What does it say about the current state of music when sound is treated as something unfixed and malleable, when it is allowed to transcend its own boundaries and inhabit new territories? It means that technology has enabled everything to be recorded and stored, ready for repeated use, never wearing out. It means that we have fully realized that sound is not easily killed, and that when it does die, it is reincarnated over and over.</p>"
},{
    "id": 9,
    "title":"LUI. and the Community of Internet Music",
    "date_published":"March 9, 2018",
    "credits":"Jude Buendia",
    "image":"\/images\/articles\/lui.png",
    "content":"<p id=\"credits\">(c) Migs Tarrosa</p><br><p>As modern music evolved and branched out to the public through the web, music transitioned into various new subgenres mixed and matched with past genres. One of these is lo-fi, a rising genre in the safe home we call the internet. Javier Pimentel a.k.a. lui. is one of the many prolific artists rising in the local lo-fi community, and he has gone a long way into creating pieces influenced by artists across the internet yet true to his creative self.</p><br><p id=\"quotation\">“I started producing music when I started learning at Cosmic Sonic Arts.”</p><br><p>Lui. had always listened to “traditional” music but soon got influenced into discovering the internet genres of vaporwave, lo-fi, and future funk. Local music producers from SoundCloud such as similarobjects to international stars such as Kanye West continually influence his works. The Strokes, The Beatles, and Gorillaz also found their way into lui.’s musical journey. Though he admits he is not an expert in the art of music theory, he, however, finds old pieces, samples them, and hashes around a brand-new piece— signed with his personal creative style of creating beats. Sampling from an array of hip-hop artists and collectives such as MF Doom, A Tribe Called Quest, and so many more, lui. is able to build up his music career to a higher level, being part of the notable music producers that are attempting to give a name to the rising lo-fi community in the local music scene.</p><br><img id=\"inline-image\" src=\/images\/articles\/lui2.png><p id=\"credits\">(c) Migs Tarrosa</p><br><p id=\"quotation\">“At the start, it’s really gonna sound like shit.”</p><br><p>It’s no doubt that lui. already has mastered his own style. For the ambitious artists that also want to make a name out there, lui. advises dwelling in all of the genres you love or might appreciate. “For example, you used to be a metal-head, then [you do] lo-fi or hip-hop, then indie, then vaporwave. All of these genres will come together and create your own unique sound.” Though there is nothing wrong with wanting to be like one’s idols, developing an individual style of music often comes from the practice of just being true to the creative self. Lui. finally adds, “just do you and eventually, you’ll make something that you really, really like.”</p><br><p id=\"quotation\">“There is a community, not just lo-fi but all music genres.”</p><br><p>The internet beat makers and producers are becoming more prevalent, according to lui. With the rise of social media, the music lui. produces become more trending, uso in this generation. More nights (in Black Market for example) are opening up solely dedicated to internet music. The lo-fi community according to lui. is growing. “I hope we would be recognized more. And, for the upcoming people when they start making, they would become their own individuals with their own unique sound.” The future is definitely bright for the musicians of the genre. The internet is rising, and so are they.</p>"
},{
    "id": 8,
    "title":"The Versitility of Calm in 'Chill Music'",
    "date_published":"March 9, 2018",
    "credits":"Sophia Bonoan",
    "image":"\/images\/articles\/chill.png",
    "content":"<i><p>“I like to reserve it for commutes when the sun is setting.”</p><p>“I imagine myself sitting on my balcony looking out over the city and smoking a cigarette after a night of drinking.”</p><p>“Sounds like momol music to me.”</p></i><br><p> These are comments made by some when asked to describe a list of songs that shared similar qualities: slow tempos, pronounced bass, sometimes a little crackling throughout to emulate a needle scratching along the surface of vinyl. The type of music you’d sway slowly to in a crowded bar at 11 pm, another one said; it’s something you’ve listened to at a certain time and place and have thus associated it with ever since.</p><br><p>It’s 4:15 in the morning and my mother is knocking on my bedroom door, telling me to get up. She’s been waking me up a little earlier recently, and I attribute this to the fact that I’m not remotely a morning person, and it often takes several more knocks and scolding to get me out of bed. Everyday trips to school from my home in Cainta have to begin exactly an hour from the moment I’m woken up, or the Pasig traffic will keep us on the road for a sure hour and a half, maybe even longer. I resent the early hours of the day, and I relish the silence of my bedroom, save for the whirring of my aircon and the neighbor’s rooster crowing from his backyard. Then one day I get a song stuck in my head and am so desperate to get it out that I decide to use the oldest trick in the book—play the song itself. So at a time when I’d rather be asleep, I’m doing my rushed routine to the voice of Jess Connelly. Several songs and one playlist later, my pre-sunrise hours have distinctly improved, and I give thanks to R&B and all its kin. This is how I know that music.</p><br><img id=\"inline-image\" src=\/images\/articles\/grouper_paradise.jpg><p id=\"credits\">(c) Grouper, Paradise Valley</p><br><p>Now here’s the thing about alternative R&B, ambient, soul, vaporwave, and whatever fits the category—they’re fluid. Before 5 am is my primetime for Lewis Del Mar and B.P. Valenzuela, but a few mentioned earlier differed in that arena. Even you might disagree with the preferences and have your own. But we can agree on this: it all comes down to association and mood, and the umbrella term that is “chill music” is one of versatility. Take for example, the music of newcomer Raveena.</p><br><p id=\"quotation\">For me, the central idea was about music as a place you go to . . . there’s not somebody in that field leading you around; you find your own way.- Brian Eno</p><br><p> Fresh on the American soul-pop scene, she has an EP slowly being added to on both Spotify and Soundcloud, Shanti. Consisting of dreamlike and sensual R&B jams reminiscent of Aaliyah and D’Angelo, as described by the artist herself, the songs have inspired different responses from a few people, and they look very much like the ones above. One person mentions how the music makes her feel wistful and in need of a hug (and maybe a little more), while another mentions the feeling of nostalgia for something he never had. Both valid and apt reviews, they were reminiscent of all the ones that came before them, and I found a recurring detail said about similar songs: no matter the image painted in their head, it was always something tranquil and sentimental, although the latter was always the hardest for them to explain. Even Brian Eno, one of the spearheads of ambient music, simply stated, “[it] is intended to induce calm and a space to think.” I think we can agree on that.</p><br><p>If you still don’t know what this category of music makes you think of, or you just want to disappear in that feeling again, try giving my early morning playlist a listen. Maybe you’ll find something on there you like, and if you do, I don’t mind a good conversation about it.</p><br><iframe src=\"https://open.spotify.com/embed?uri=spotify%3Auser%3Asophiabonoan%3Aplaylist%3A67VMwBcaIWflfb6GDiTECq\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>"
},{
    "id": 7,
    "title":"Soloists' Night Offered a Little Something for Everyone",
    "date_published":"December 13, 2017",
    "credits":"Sophia Bonoan, Jude Buendia & Lorenzo Escober",
    "image":"\/images\/articles\/soloists.png",
    "content":"<p>Performers and music-lovers alike huddled together in Sessions Bar & Resto for 2017’s Rites of Passage Vol. II: Soloists’ Night. With a lineup of soloists collated into groups representing different themes, the night was both musically diverse and entertaining.</p><p><Getting the night started were the roster heads, who ignited the crowd with a funky rendition of Michael Jackson’s P.Y.T. Once the mood had been set, the soloist groups began taking the stage, beginning with Different Strokes. The 90s group brought back the sounds of their childhood with a set fueled by teen-angst, with songs like All Apologies, Creep, and Magasin, and original composition Alone. They were an energetic start to the night, getting the crowd roused for the sets ahead.</p><br><p>The country group, cheekily named What the Folk, played standards Sweet Home Alabama and Leaving on a Jet Plane, along with original song Drunk On a Thursday Night. Other than the genre that defined the set, the group also had another recurring theme: all the songs they played belonged to dead artists, including a heartfelt tribute to the late Taylor Swift with Love Story.</p><br><img id=\"inline-image\" src=\/images\/articles\/soloists2.png><br><p>Next was the self-proclaimed “sexier sounds” of the night, the blues and soul chapter. True to this proclamation, the group got the crowd swaying and snapping their fingers to their renditions of songs like Hit The Road Jack and Valerie. While their genre is known to be slow and soulful, the band made sure to add some liveliness to their set, with some guitar, piano, and drum solos scattered throughout that captivated the audience and made them go crazy.</p><br><img id=\"inline-image\" src=\/images\/articles\/soloists3.png><br><p>What’s a jam night session without some iconic pop songs from the 70s and 80s? The soloists put on a show for AMP’s audience as they slowly start with an emotional hymn by Cyndi Lauper: Time After Time. However, they soon kicked off the beat with dance anthem by one and only KING of Pop, Michael Jackson. Rock With You rocked the house down leaving the audience dancing to their beat. They then transitioned into a masterful mix of modern pop songs such as Versace on the Floor, finally ending their set with a karaoke special: Don’t Stop Believing.</p><br><p>The soloists end the night with 70s Hard Rock classic songs. Every AC/DC fan surely enjoyed themselves, as the last band of soloists start their performance with Highway to Hell. The audience sang along with a dynamic set full of vibration and energy. Their renditions of Don’t Want to Miss a Thing, Stairway to Heaven, and a mix of modern and original songs gave life to the audience as the AMP musicians wildly end the night-- the Soloists Night.</p>"
},{
    "id": 6,
    "title":"Last Name Basis & the Transformative Power of a Good Retreat",
    "date_published":"December 13, 2017",
    "credits":"Lorenzo Escober",
    "image":"\/images\/articles\/lastname_basis.png",
    "content":"<p>It isn’t obvious now, but acoustic duo Last Name Basis used to hate each other. I look at them and try to imagine such a reality, but at the moment one would be forgiven to think that Bells and Tor hatched from the same egg.</p><br><p>Born out of necessity, the band was formed in high school, when the two singer-songwriters were forced together in their music org. Tor, the older one, played the Regina George to Bell’s Cady Heron.</p><br><p>“I was like, this lower batch girl” Tor recalls with faux disdain, remembering the tension that predicated their relationship. Petty as it may sound, it carried on for quite some time until the two went on a school retreat. Needless to say, the metanoia was real.</p><br><p>Such is their fortified friendship that Last Name’s set at AMP’s Rites of Passage seems to bring everyone closer together. Maybe it’s the acoustic set-up and its ability to foster intimacy in the most dispersed of audiences. Maybe it’s just their sheer talent: armed with nothing but their voices and Tor’s guitar, the two make for a compelling act, despite the obvious limitations of being so stripped-down. They open with a clever mash-up of Eurythmics’ Sweet Dreams (Are Made Of This) and Adele’s Rumor Has It. Bells starts with minimal accompaniment and innocent vocals, before Tor jumps in with soulful conviction. They meet one another at the chorus, harmonizing effortlessly. I compliment them for their vocalization two weeks later. They gush with delight.</p><br><p>“Dude, it took so long.” Bells tells me, “[Harmonizing] gave us such a hard time [at first].”</p><br><p>Evidently, practice paid off. They perform another mash-up, this time of Emily King’s Down and Distance. John Legend’s P.D.A. (We Just Don’t Care) is given an acoustic treatment, after which they perform Woman, by favorite music duo HONNE. They introduce their original song, Crushie, as a joint manifesto recalling their entry into college and all the cute boys that made that transition so memorable. Their set feels personal, because it is. Bels and Tor only write about real experiences, translating life into art.</p><br><p>“I like how, being a duo, [we] get to [have] a personal language with the audience,” Tor says.</p><br><p>Bells nods. “Even when we [cover] songs, we always have to have something to latch on to.”</p><br><p>It’s this individualized edge that allows for the room they perform in to shrink exponentially. It’s as if Last Name Basis’ friendship—the happy crushes, the frustrations, every experience—has been recorded in their music, and now they’re inviting you to be a part of it.</p>"
},{
    "id": 5,
    "title":"Lolo's Polo Has Arrived",
    "date_published":"December 13, 2017",
    "credits":"Lorenzo Escober",
    "image":"\/images\/articles\/lolos_polo.png",
    "content":"<p>It’s eleven o’ clock on a Saturday night, and a palpable anticipation for the last band hangs in the air. The people seem to know that they’re about to witness something explosive.</p><br><p>Due to a double-booking error, this year’s Rites of Passage doesn’t take place at Mow’s, but on the third floor of the Kowloon House along Matalino Street. In the neighboring function room is an Indian wedding reception. As I brush shoulders with a woman in a sari on her way to the bathroom, I catch sight of the four of them preparing for their set. I enter the crowded room, a cocktail of characters composed of AMP members, performers’ families, and two members of Ang Bandang Shirley. Plastic table sets are strewn around an asymmetrical stage. Epileptic strobe lights occupy the right side of the room. A makeshift bar has been set up at the back. People are agitatedly excited. This is where Lolo’s Polo makes their debut.</p><br><p>I’d been hastily introduced to Lino, the lead singer and guitarist, some hours before. When I ask him how he’s feeling, he smiles faintly and looks past me, towards the stage. “I’m fine,” he mutters. “I feel like we’re older than everybody else.” He excuses himself and shuffles away to his friends. Jamo, the drummer and eldest member, exudes a similar nonchalance as I corner him behind a door and force him to answer my questions. “We didn’t want to go last,” is all he seems to care about. I assure him that closing a show can turn a good set into a great one. He nods but doesn’t say much else, so I ask him about his outfit. “It’s a polo.” He explains, gesturing at what is obviously a polo, cut and fitted in the style of the proverbial Philippine senator. “We swore we’d never wear polos, but look at us.”</p><br><p>It’s two weeks later, and Lino is recounting the night from his own perspective, revising my recollections: “I was so nervous,” he says. “I haven’t felt jitters like that in a while. It really felt like something new. There was a lot of uncertainty, which I think we thrived on in the end.”</p><br><p>For the band, coming together didn’t happen instantaneously. Miko, the guitarist, Nat, the bassist, and Lino had crossed paths in high school, but the idea of assembling never quite occurred to them until they found themselves together in college once more. Jamo came along to complete the group, solidifying years of cursory encounters. Right now, however, he’s nowhere to be found; a felt absence in our interview. That doesn’t stop us from talking about him though.</p><br><p>“He said no the first time we asked him to be part of the band, coz he had a lot of things on his plate,” Lino recalls. “But we sweetened the deal eventually.”</p><br><p>“Jamo’s actually my neighbor,” Nat puts in. “He lives right in front of my unit, and we never talked.”</p><br><p>“There was a spiritual connection from the start. It was destined.” Lino says with a slight lisp, pronounced enough to mildly irk a speech coach but not as severe as that kid on Stranger Things. If anything, however, it only seems to add to his magnetic character. Impish in an Instagram-friendly way, Lino is a definitive frontman, with an electric presence and a strong, searing voice. Born into a musical family and raised on The Beatles, Led Zeppelin and The Rolling Stones, he got his start playing in his older brother’s band, Hansom. As we speak, I’m secretly thankful that he bypasses my gaze. Direct eye-contact just doesn’t seem to be something I’m ready for. He isn’t intimidating; he’s just born cooler than most people. The group’s primary songwriter, Lino has the charisma of an irreverent class delinquent and the creative intellect of a tormented poet. Currently minoring in creative writing, he counts APO Hiking member Jim Parades as one of his professors. I ask him which lyric he’s proudest of. He opts for a line in the second verse of Lights Out, a piece of social commentary on the country’s current political context: The pigs are coming out and they’re dressed in blue / Mud dries well under leather shoes. “It’s a very Orwellian image,” he says. I take this as a cue to pursue a literary digression.</p><br><p>Nat, who looks scary but is actually a nice guy who reads Oscar Wilde, likes The Portrait of Dorian Gray for its striking yet simplistic utilization of language. Educated in guitar by a perpetually hungover tutor, he developed a fascination with the bass, making the switch eventually. “Some people think it’s boring,” he says with a voice that matches his instrument. “I think there’s lots of creative things to do with it.” I think of the riff in Michael Jackson’s Wanna Be Startin’ Somethin’ or the drone in Fleetwood Mac’s The Chain and agree wholeheartedly.</p><br><p>Miko lights up when I ask him what his favorite book is. “Catcher in the Rye,” he says, sure of himself. The other two jokingly mock his angry boy predilections. Tall and lanky, Miko is an excellent guitarist, able to give flesh and blood to the skeletal song structures Lino brings to the operating table. “I feel like there’s a bit of Holden Caulfield in all of us,” he continues. “[It’s] that part of us that feels frustrated. I feel like there’s a correlation between that book and my angry guitar,” he laughs.</p><br><p>“Is Lolo’s Polo an outlet for your leftover teenage angst?” I ask.</p><br><p>“I feel like it’s a developed teenage angst,” Lino says. “Like we’re angsty boys who grew up and are beginning to understand what we felt before.”</p><br><p>If Lolo’s Polo’s sound were a movie character, it would be Randy Floyd from Dazed & Confused, if it were an actor, Nat thinks it would be Arnold Schwarzenegger. Anyone angry at the world would do. When they’ve gotten a song together but Lino hasn’t written lyrics yet, they improvise by shrieking fuck yous for minutes on end. It’s a cathartic ritual, and it pays off when they debut in front of an audience that just wants to rock out already.</p><br><p>“My name is Lino,” Lino says to the audience at Kowloon House, “and I’m wearing my lolo’s polo.” The audience laughs, and, because I’m a sheep, I laugh with them. People are chanting for Jamo to take his shirt off. My drunk friend yells profane declarations of love aimed at Nat, then apologizes to his girlfriend. There’s a guy in front of me who keeps shaking a can of nails in one hand and a bottle of Sprite in the other. I don’t get any of it. I don’t care. The music stands on its own.</p><br><p>The performance is the band’s baptism by fire. Dynamic and guttural, it stimulates the kind of cultish hysteria usually reserved for established names. A spontaneous mosh pit mobilizes itself into frenzied possession. Everything they cover is fitting, from Gorillaz’s Clint Eastwood to Arctic Monkeys’ I Bet You Look Good on the Dancefloor. It’s their cutthroat delivery, however, that distinguishes them from bands who might draw from the same influences. They sound rebellious, hungry, rude, like a mob at the height of a protest. By the time they launch into their original song—a sensational hard rock banger called Cut Me Loose—the audience has lost its mind. As I bend down to pick my underwear off the floor, I remember that this is their debut. Their debut.</p><br><p>“I didn’t think we were capable of getting that kind of reaction,” Nat tells me.</p><br><p>Lino nods. “We’re so thankful for the AMP community. Rites was fun man. As soon as we started playing, nawala yung jitters. It felt natural to be up there.”</p>"
},{
    "id": 4,
    "title":"Indayo is Here for the Voiceless",
    "date_published":"December 13, 2017",
    "credits":"Ada Tabanao",
    "image":"\/images\/articles\/indayo.png",
    "content":"<p>Indayo is a five-piece Indie-Alternative/Pop band. The band’s name came from the Tagalog word “Indayog\", meaning /\"rhythm\". “We just decided to remove the \"g\" because we thought it sounded cooler.” The members are Lia Alfonso as both vocalist and bassist, Cha Umali as the lead guitarist, Melissa Ramos as the violinist, Cita Alfonso as the drummer, and Mela Roque as the cellist. The all-female band is a mix of loud, quirky, and passionate individuals. Melissa notes that their status as an all-girl indie-alternative pop band gives them an edge since it is not common in the music industry. They have released two original singles on Soundcloud, namely “Tug of War” and “Elude”.  They are a band who “writes songs about everyone's personal experiences.” Their songs are anthems of self-love and hope.</p><br><p>Indayo is the first band to perform after Ashley's Kryptonite. They are introduced as a “freshie band.” They start their set with their original song “Decisions”, followed by a cover of “Arbitrary” by Over October. Their original songs are written in English. They play two more originals: “Under My Skin” and “Tug of War.” Before they play the song, Lia explains that their original, “Tug of War”, is about “believing in yourself and trusting yourself in whatever you’ll do.” Their sound is reminiscent of The Ransom Collective; with a colorful clash of instruments. They end their set with a cover of “Bukang Liwayway” by Munimuni. When asked about musical influences, the band names both international and local artists: Coldplay, John Mayer, Paramore, Up Dharma Down, and Munimuni.</p><br><p>AMP asks the band about their history, music style, and future plans:</p><br><p>How did you guys meet?</p><p>We all came from the same high school, St. Paul College Pasig, and we were all part of the same music organization in that school called MAC-I. From there, we just clicked and decided why not form a band.</p><br><p>How would you describe your music style?</p><p>Our music style is a mix of alternative pop but sometimes we incorporate funk to add some groove. Normally, we like to experiment around those genres and then try to mix it to make a new sound.</p><br><p>What are your plans for the future? (EP/Album/Gigs/Etc.)</p><p>Right now, we are already planning our release of our first single. Hopefully by January, we get to release it. [On] 2018 we'll focus on recording an EP and again, hopefully, release it on May! For gigs, we'll post upcoming dates in our Facebook page.</p><br><p>On an interview with Gouache Bags, Melissa notes the band’s dreams are “to create music that is personally and socially relevant” and “[to] give a voice to those who can’t seem to transform their thoughts into words through the music we make.” Indayo is off to a good start, who knows how far they will go in their career.</p>"
},{
    "id": 3,
    "title":"The Monday Experience",
    "date_published":"December 13, 2017",
    "credits":"Jude Buendia",
    "image":"\/images\/articles\/monday.png",
    "content":"<p>“Tomfooleries and flimflams.”</p><p>These are two words by Drummer-boy, Pancho Santos, describe the life within the band: Mondays at 4. He unfolds what his bandmates had gone through and what they have in store for us. Bassist, Mio Garcia, and guitarist, B-boy Morales, accompany his side. Though fellow bandmates, MC Monserrat (keyboard), PJ Roxas (Guitar) and Koi Calleja (Vocals), were absent, the band felt complete.</p><br><p>SEC Walk</p><p>As students rush by to their next classes, the three boys sit down on a concrete bench. Mio, Pancho, B-boy. All three lined up. The questions roll. Mondays started during their second year of high school. They were initially four members.</p><br><p>“We didn’t really have a band name yet. We actually started our band name without a vocalist and stuff. And then, after that, the vocalist missed the bus. He had nothing to do in school and so he decided to jam with us. Yeah, tumugtog siya ng songs. That’s where it started. Mio came along and then MC came along.”</p><br><p>From that moment, Mondays at 4 started. They found themselves playing in numerous bar gigs, school fairs, and college events. They made numerous songs. They attracted numerous fans. Their batch-mates, teachers, and even school staff love them. “Ang saya na they watch us, they support us, they love us.” B-boy expresses. Indeed, everyone loves them. Their music feels human, close to the heart. Mondays’ songs cry heartbreak, love, and all that hugot jazz. Mio even deconstructs the recipe for a Mondays at 4 special. “One cup of heartbreak and a lot of gago jamming.” Pancho adds to the mix. “And lots of calls to Jollibee and Mcdo to order food. Lots of fighting. Lots food from PJs also.” Mondays present themselves to be ordinary people with a nice sense of humor— real. But on stage, they’re beyond unreal.</p><br><p>Mow’s</p><p>New to AMP, Mondays rose far from what people expected. AMP’s annual Rites of Passage was their milestone. “We had like so much fun. We never felt so alive. It was revitalizing.” Their first gig as college students was theirs. They owned it, and they want more. Mondays played the house down with their emotional atmosphere and connection between every member. When the guitar riffs and instrumental parts would play, they would face and form a circle as if telepathically synchronizing with each other. Chills and goosebumps will be felt, song after song after song. Kanin, Elle, Kahit Na, Kiss Sabay Hug. Each member was intent. Mio played the bass with intensity. B-boy and PJ played their guitar with intensity. Koi serenaded the audience intensity. Pancho drummed the second floor down with intensity. There was passion. There was heart. There was talent. It was an explosive start for their debut year.</p><br><p>Rites for them was a stepping stone in AMP and they’re sprinting. They went from ordinary high school kids to college favorites. As freshmen, Mondays at 4 is starting the year fresher than ever. They’re causing mayhem and we love it. Though separated to either UP or Ateneo, Mondays is still ambitious. “Tighter sound and maybe release a CD.” Pancho envisions his band. Separation definitely won’t distance them from being one of the top bands to watch out for in AMP. In Pancho’s words, there’s only one way to experience this tomfoolery and flimflams of a performance. “Come on down, as they say in the Price is Right.”</p>"
}, {
    "id": 2,
    "title":"The Phenomenology of Listening to Music",
    "date_published":"December 13, 2017",
    "credits":"Bianca F. Gonzales",
    "image":"\/images\/articles\/phenomenology.png",
    "content":"<p>The concept of music has been said to exist since the time of the Greeks, and possibly even way before that. With the concept of music constantly evolving up to this day, in the sense that the overlap between what is considered as mere noise and what is considered as music is often debated upon, the concept of music appears to be in a state of flux.</p><br><p>The most common definition of music would be that it is a combination of sounds utilizing elements of rhythm, melody, and harmony, and is often a form of emotional expression.</p><br><p>In spite of the common definition of music being as definite as it sounds, the concept of music can also be said to be both universal and unique. Music can be said to be universal because no matter where you go the concept of music exists. Music is said to span across all cultures ever since the time of the Greeks (possibly even way before), and is constantly evolving up to this day.</p><br><p>On the other hand, music can be said to be unique because certain genres are observed to be more prominent depending on the culture. Moreover, what is considered as music is often dependent on an individual’s personal preferences. When I am looking to update my music library, I often make use of Spotify (a music streaming service) and its suggestion feature to discover more artists which create music similar to that of the songs already present in my music library. At present, amidst the never-ending ocean of audio files, I generally find myself drawn towards the genres of Alternative/Indie Rock, and R&B.</p><br><p>Once I find a particular song or track that I like, I then proceed to add it to my playlist, with the intent of downloading it on my phone so I can listen to it while offline. In this way, the music becomes mine , even if I am well aware that all credit is due to the artists who composed it.</p><br><p>The playlists which I curate for my own listening pleasure are in a way an artistic arrangement on its own, perhaps even an embodiment of who I am as an individual. It follows therefore, that whenever I share my playlists to my friends, it is as if I am sharing a part of myself with them.</p><br><p>When I listen to my music, I often feel as if I am triggering the awakening of my body in such a way that it completely synchronizes with my consciousness. Even if my headphones were only transmitting the sound waves to my ears, my head begins to make bobbing motions to the rhythm of whatever song is playing. It is not as if I need to knowingly instruct myself to move my head while taking note of the song’s tempo. It just does.</p><br><p>Perhaps the motions my head makes can be excused since my ears are on my head, and the distance between my ears and the rest of my head is not remarkable by any means. Therefore it would be no surprise to come to the conclusion that the same vibrations which travel to my ears, travel almost simultaneously to the rest of my head as well. In a sense, my head is at an advantage over the rest of my body in terms of proximity.</p><br><p>However, if I were to consider proximity as an advantage, how then would I explain why my arms and legs begin to flail about (some might call it dancing) in synchronization with the bobbing of my head, in spite of the significant difference in distance? Just as I mentioned earlier, it is not as if I need to consciously instruct my arms and legs to move in such a way, or in a particular direction, all whilemeticulously noting any changes in tempo. It is as if they have a mind of their own.</p><br><p>Whenever I listen to my music while while taking a walk, or perhaps getting some work done, it is as if my music becomes one with my consciousness. Once I start listening to my music, my emotions, as well as my overall mood, seem to reflect the energy given off by a particular type of music. For instance, if I were listening to my playlist entitled Ice Cream (more relaxed and laid-back alternative/indie songs), I would immediately begin to feel relaxed and carefree. I often find myself listening to this playlist on early mornings, in order to start my days with a positive disposition.</p><br><p>On the other hand, if I were listening to my playlist entitled Muscle Cars (more alternative/indie rock, and R&B/soul songs), I would immediately begin to feel more energetic and ambitious -- as if I can conquer the world. I often find myself listening to this playlist on the way home after a long day (as if going through that day was an act of valor on its own), or when I have a long night ahead of me, and I need all the focus I can muster in order to get my work done as efficiently as possible.</p><br><p>The more I think about it, my enjoyment or appreciation of my music is not dependent on where I hear it. I have previously elaborated on the more private setting of listening to music with headphones on, however there have been instances wherein I would listen to my music above the recommended volume in order to feel the music even more. In these moments, some of the sound waves and vibrations escape the confines of my head and veer into the more public space surrounding me. Nevertheless, I still find that the proximity between my music and my ears is intimate enough to still be considered as <i>mine</i>.</p><br><img id=\"inline-image\" src=\/images\/articles\/phenomenology2.png><br><p>In some instances however, I come across songs from my playlist or music library in a more public setting, such as on the radio, or at a restaurant. During these occasions, the act of listening to what I consider as my music becomes a more collective and shared experience. Yet I often find myself exclaiming “hey it’s my song!” in spite of these encounters being more public in nature.</p><br><p>Interestingly enough, the mere act of hearing my music (even if I am unable to pinpoint the source) already causes me to bob my head, or tap my foot to the rhythm without me being fully aware that it is even happening. In these cases, proximity is no longer on my side, and yet my body, as well as my consciousness acts as if the music never left my system to begin with. It is as if the music left an imprint on my system, and remains dormant until it is awakened by the musical stimulus.</p><br><p>I now realize that my music does not have to be on my phone or on my playlist in order for it to be considered as mine . Regardless of whether I hear my music on the radio, at a restaurant, or perhaps even as a soundtrack in a movie, it is not the proximity, but rather the impression that song imparts on me, that allows me the privilege of calling that song <i>mine</i>.</p>"
},{
    "id": 1,
    "title":"TUBE Throwback: Ano Nga Ba Tayo? (The Sublimity of Beauty in Ashley's Kriptonite's EP)",
    "date_published":"December 13, 2017",
    "credits":"Karl Estuart",
    "image":"\/images\/articles\/kryptonite.png",
    "content":"<p>Sakit, pare.</p><br><p>Nothing would be a more apt summary for what Ashley’s Kryptonite’s new EP, Tayo, is about. Or I could be mistaken, and behind the opening line Galit ka ba / sa buhay mong / kinulang sa saya? which reads initially as a frustrated and frankly juvenile confession of emptiness is really just a wry and flippant youth speaking of a life that, in reality – and he knows it – overflows with joy. Sure, things might suck – your love life is in the trash can once again, and you just know you’re going to pull it out again soon once you’ve received your daily fix of hope – but this façade of melancholy is exactly what comprises tayo. It is the tayo that gives purpose, energy, and meaning to everything – the litany of random objects in the sleeve photos are suddenly loaded with history, meanings and memory already half-forgotten and only half-real. The tayo is very real, and, at the same time, there never was a tayo – whether it only existed in the mind in the music, it cannot be denied that we experienced it, and these songs call out to that experience and know it for what it is: uncertain, half-formed, recurring, beautiful.</p><br><p>To speak of tayo, Ashley’s Kryptonite resorts to tightly composed rock numbers that never overstay their welcome. Each song bursts with personality, and there is no thematic inconsistency to speak of: a preoccupation with the bittersweet birthed these songs, and certainly all of them speak of the certain experience in such general terms, with such energy and earnestness, it knows we’ve all been there, and it practically begs us to affirm it. And yes, we have been there.</p><br><p>Isaw – the title, which is a play on the word sawi, relates fantastically to the image of random found objects photographed in the EP sleeve design – it sounds exactly like what the cover looks like: sweet, suburban, still, fraught with gentleness that is simply waiting to explode. But it is patient, and it has been here for a while: see the flower petals that have settled there. Soon, piano scales and bass gracefully enter the scene, prolonging the inevitable collapse by gently cushioning the fall. And then it hits: the song Tayo bursts through with Cholo Ledesma’s propulsive drums, bides its time in the prechorus, and then realizes – wala namang tayo – and the song loses itself, charged with angst without all the edge or sharpness. Even at its loudest, the band performs sweetly, though certainly it is not only because they know exactly what to make us feel and how to make us feel it, but because they feel it as well.</p><br><img id=\"inline-image\" src=\"\/images\/articles\/kryptonite2.jpg\"><br><p>Labandera, one of their older songs, goes for a more clever turn of phrase with its lyrics, where the last syllables of every line in the verse lead into the first syllables of the following line. Lalakad palayo kasi ako’y nalulum- / bye bye na sayo kasi ‘di mo pinapansin, among other lines, but the same figure is present in the titular line – maalala ba / maala-labandera. A concrete experience whose pain and pleasure is diverted onto a completely separated image – it all makes too much sense. We feel it.</p><br><p>It’s hard to explain how the band manages to provoke such empathy. The precision of the feelings drawn out by the music certainly makes it feel like that band’s zeroed in on a formula of their own. Tangibly, there are continuities across the songs – embittered and resonant vocals that simply beg for sing-a-longs, a powerful lead guitar by Josh Jimenez placed forward and serving as a counterpoint to the vocals, the tasteful bass by Mike Tee that never overpowers, the drums that direct the tide with cleverly deployed fills. But just as you pick up on these, there are just as many disruptions that arise – the first song, in particular, follows a completely different and acoustic structure; certain instrumental breakdowns and variations in guitar effects and production across the album reveal another dimension to the universal melancholy. And it is precisely from all that I listed that give each song their own unique form – the compositions are consistently compulsive, high-wired, free-wheeling, impassioned, always performed with charismatic know-how. The band is completely in touch with the experience of tayo – knowing when to deviate, insert a segue, fixate on an afterthought, or brood, even. It speaks with expertise, knowledge, but it never insists on its own coolness – thankfully the compositions do not veer into self-indulgent territory – but rather sticks to what it knows. It plays a game every time and knows how it’ll end, but never to prove a point nor itself, but simply because the tayo is inevitable to it.</p><br><p>I suppose this is what keeps the EP sounding fresh every replay – it sounds like they’re going through another round at it every time, narrating an iteration of tayo and reveling in the bittersweet while constantly keeping an eye out for cities and streets yet unexplored, for how it may be made new. Here, on this particular listen, the streets are coated in vines, the roads are coated in flower petals, and she isn’t leaving him yet. This is because he never had her. Not on this listen, and not in the previous. Perhaps in the next.</p><br><p>February 27, 2016</p><br><p>Source for the album art: https://www.facebook.com/events/430287647173201/</p><br><p>Original Article: http://amplitubeonline.tumblr.com/post/140100239869/ano-nga-ba-tayo-the-sublimity-of-beauty-in</p>"
}]