[
    {
        "image":"/images/about/departments/cb_am.jpg",
        "name":"Artist Management (AM)",
        "description":"Artists Management is a department devoted to the wholesome development of AMP's musicians in order to bring out the best in its members, not just in skill but also in work ethic, attitude, and professionalism. AM challenges its members to do more and be more as musicians through workshops, jam sessions, live performances, and much more.",
        "officers":[
            {
                "name":"John Carlo E. Lagac (AM Head)"
            },
            {
                "name":"Luis Alfonso R. Montales (Soloist Artist Coordinator Head)"
            },
            {
                "name":"Luigi Antonio F. Caluag (SE Head)"
            },
            {
                "name":"Miguel Luis P. Del Rosario (Band Artist Coordinator)"
            }
        ]
    },
    {
        "image":"/images/about/departments/cb_dd.jpg",
        "name":"Design (DD)",
        "description":"The Design Department houses all of the visual artists of AMP. They give the organization a stronger visual identity through its posters, logos, album covers, and other paraphernalia.",
        "officers":[
            {
                "name":"Kathrynn Marie G. Segui (DD Head)"
            },
            {
                "name":"Francis Dio F. Calpatura (Graphic Design Deputy)"
            },
            {
                "name":"Katrina Fai F. Batara (Production Design Deputy)"
            }
        ]
    },
    {
        "image":"/images/about/departments/cb_dp.jpg",
        "name":"Documentations &amp; Publications (DP)",
        "description":"The Documentation &amp; Publications department houses all of AMP's photographers, writers and videographers. They commemorate the experience that AMP creates. In short, they make history.",
        "officers":[
            {
                "name":"Martha Isabel C. Pangilinan (DP Head)"
            },
            {
                "name":"Joshua Martin Villanueva (Videography Deputy)"
            },
            {
                "name":"Carlo Onglatco Jardeleza (Photography Deputy)"
            },
            {
                "name":"Arnaldo Ariston D. Paguio (Writing Deputy)"
            }
        ]
    },
    {
        "image":"/images/about/departments/cb_default.jpg",
        "name":"Sales &amp; Sponsorships (S&amp;S)",
        "description":"The Sales and Sponsorships department is the business-minded side of the organization that aims to raise revenues and exposure necessary to launch the organization's projects. Particularly, the department is in charge of doing fundraisers, producing merchandise, and expanding corporate relations to support the organization's goal in spreading music.",
        "officers":[
            {
                "name":"Joaquin Alfonso M. Balina (S&amp;S Head)"
            },
            {
                "name":"Francesca Isabel T. Diyco (Corporate Relations Deputy)"
            },
            {
                "name":"Nina Sofia P. Guinto (Fundraising Deputy)"
            }
        ]
    },
    {
        "image":"/images/about/departments/cb_default.jpg",
        "name":"Strategic Planning of Promotions (SPP)",
        "description":"The Strategic Planning of Promotions Department (SPP) aims to maintain the public image of the organization through the management and development of the promotion of AMP’s output through its respective social media platforms (Facebook, Twitter, Instagram, Spotify), and strategically determine the status of the organization through the use of marketing research efforts.",
        "officers":[
            {
                "name":"Kaelen Andrea S. Reyes (SPP Head)"
            },
            {
                "name":"Nicole Dianne G. Soler (Marketing Deputy)"
            },
            {
                "name":"Gabrielle Angelli E. Yap (Promotions Deputy)"
            }
        ]
    }
]