[
    {
        "member":{
            "name":"Kaelen Andrea S. Reyes",
            "year":2017,
            "course":"AB COM"
        },
        "position":"President",
        "description":"The President oversees and coordinates all activities of the organization with regards to aspects and functions related but not limited to administrative, finance, corporate relations, member development and formation, artist management, and the core competencies of the organization. He represents the organization to the different school offices and makes sure that the voice of the organization is heard."
    },
    {
        "member":{
            "name":"Hillary Anne T. Regalado",
            "year":2018,
            "course":"BS CTM"
        },
        "position":"Executive VP for Administration ",
        "description":"The Executive VP for Administration manages the overall database of the organization. She is in charge of filing and collating all organization documents, managing the calendar of events of the organization, data collection and dissemination, keeping track of the deadlines of the Executive and Central board officers, taking the minutes during major meetings of both the Executive and Central board meetings, as well as scheduling the meetings held by the Executive board officers."
    },
    {
        "member":{
            "name":"Eloiza Glen M. Dirige",
            "year":2017,
            "course":"AB COM"
        },
        "position":"Executive VP for Internal Affairs",
        "description":"The VP for Internal Affairs takes care of all relations within the organization. She manages and attends to all Executive and Central Board officers' concerns and general welfare within the organization, manages and monitors the execution of Executive and Central Board and departmental Codes of Internal Procedures, maintains communications with the Central Board regarding details of all ongoing internal projects, plans and executes programs for leadership formation catered to the members of the organization."
    },
    {
        "member":{
            "name":"Pancho Enrique M. Santos",
            "year":2016,
            "course":"AB MEC"
        },
        "position":"VP for Member Development",
        "description":"The VP for Member Development coordinates with all Central Board Department Heads with formulating the different training curriculum of each department, plans and executes interdepartmental projects,, monitors and tracks the execution of all training programs, including mentorship and workshops of the different departments, and coordinates with department heads to create workshops catered to teaching members the essential and relative skills and competencies of each department."
    },
    {
        "member":{
            "name":"Sophia Ysabelle N. Policarpio",
            "year":2018,
            "course":"BS CTM"
        },
        "position":"VP for Project Management",
        "description":"The VP for Project Management facilitates the application and appointment process for recruiting heads for all projects before the start of the first semester, conducts at least one project head training seminar and releases a general project manual to all project heads before the start of the first semester. She also keeps track of the progress of the different projects and updates the Executive and Central Board accordingly, conducts post project evaluations and focused group discussions on the performance of the project, project team, and project heads, as well as step in as the mediator should major problems that the project team cannot handle on their own occur."
    },
    {
        "member":{
            "name":"Neale Christian T. Tiu",
            "year":2018,
            "course":"BS PSY"
        },
        "position":"VP for External Affairs",
        "description":"The VP for External Affairs facilitates all external affairs and partnerships of the organization by serving as the main representative, mediator, and negotiator. He maintains communications with the Central and Executive Board regarding the details of all ongoing external affairs including partnerships, oversee and maintain communications with the alumni of the organization and coordinates with them for matters involving relations, partnerships and tie-ups. He also monitors and oversees the activities of the Artist Management and Sound Engineering Department."
    },
    {
        "member":{
            "name":"Julliana Ezra B. Fernandez",
            "year":2018,
            "course":"BS LM"
        },
        "position":"AVP for External Affairs",
        "description":"The AVP for External Affairs manages all tie-ups of the organization by coordinating with both the clients of the organization and the Artist Management Department. She serves as the main representative for musicians sent out for tie-up deployments,  as well as manages and ensures the execution and dissemination of the Ateneo Musicians’ Pool newsletter."
    },
    {
        "member":{
            "name":"Kelsey Danielle B. Escareal",
            "year":2018,
            "course":"BFA ID"
        },
        "position":"VP for Communications",
        "description":"The VP for Communications manages the branding of the whole organization by coordinating with and overseeing the Documentation and Publications department, Design department, and Strategic Planning of Promotions department. He oversees and approves for dissemination all organizational outputs released to the public via all forms of media. facilitate the management of the website.n"
    },
    {
        "member":{
            "name":"Joseph Heindrick H. Mellizal",
            "year":2017,
            "course":"BS ME"
        },
        "position":"VP for Finance",
        "description":"The VP for Finance serves as the treasurer of the organization. She manages the DCB account in coordination with the Central Accounting Office and the Office of Student Activities of the Loyola Schools in handling the organization’s funds, directly handles the financial planning, procurement, and investment of funds. She also delegates authority for receipt and disbursement of funds, as well as analyzes financial records to forecast budget requirements and the future financial position of the organization."
    },
    {
        "member":{
            "name":"Audrey Kimberly W. Cabrera",
            "year":2017,
            "course":"AB MEC"
        },
        "position":"AVP for Finance",
        "description":"The AVP for Finance work side by side with the Sales and Sponsorship department with regard to fundraising and corporate relations, handle centralized processes for the financial activities of projects, as well as disseminates relevant financial information at most a week after all financial data is available for each flagship project.n"
    }
]